[
  {
    "path": "work/2023-09-22-missing/",
    "title": "What is Missing?",
    "description": "The Florida Department of Corrections collects a significant amount of data for its administrative purposes. While I am unsure of the exact details as they have denied all of my FOIA requests, it is clear that they gather a substantial amount of information. This list, although not comprehensive or accurate, is presented to aid in brainstorming for those who could potentially have access to any of this data or resources to support my acquiring and analysis of it. It highlights some of the data that I suspect they may be holding and emphasizes the potential value that public access to this data could bring.",
    "author": [],
    "date": "2023-09-25",
    "categories": [],
    "contents": "\n\n\n\n\n🕳️\n\n\nWhat is Missing?\n\n\n\n\n\nData that a Department of Corrections Might Track for Administrative Use Include:\n\nData on the Staff\n\nStaff demographics\n\n\nAge (measured in years)\n\n\nGender\n\n\nRace/ethnicity\n\n\nEducational background\n\nDegree level (measured in years of education)\n\n\nMajor/field of study\n\n\n\nWork experience (measured in years)\n\n\nJob title/position\n\n\nDepartment/program affiliation\n\n\nSalary range (measured in currency)\n\n\nUnion membership\n\n\nYears of service (measured in years)\n\n\nProfessional certifications/licenses\n\n\nLanguage proficiency\n\n\nDisability status\n\n\nVeteran status\n\n\nSexual orientation\n\n\nMarital status\n\n\nGeographic location\n\n\nCommuting distance/time (measured in miles/hours)\n\n\nHousing status\n\n\nCitizenship status\n\n\nImmigration status\n\n\n\nStaff retention rates and reasons for turnover\n\n\nThe number of staff members who leave the organization voluntarily or involuntarily\n\n\nThe length of time staff members remain with the organization before leaving (measured in years)\n\n\nThe reasons that staff members leave, such as dissatisfaction with working conditions, low salary, or lack of career advancement opportunities\n\n\nThe cost of turnover, including recruitment and training expenses (measured in currency)\n\n\n\nStaff training and certification records\n\n\nTraining titles and content subject matter\n\n\nThe number of staff members who participate in each training opportunity\n\n\nThe duration and frequency of each training opportunity (measured in hours/days/weeks)\n\n\nThe qualifications and experience of trainers and instructors\n\n\nThe cost of each training opportunity and the funding sources (measured in currency)\n\n\nThe compliance of staff members with required training and certification/licensure\n\n\n\nStaff Disciplinary actions\n\n\nThe type of infraction committed by the staff member (e.g. breaking policies or procedures, insubordination)\n\n\nThe date and location of the infraction\n\n\nThe sanctions imposed, such as suspension or termination\n\n\nThe staff member's compliance with the sanctions\n\n\nAny appeals or grievances filed by the staff member regarding the infraction or sanctions\n\n\nRecords of any investigations or hearings related to the infraction\n\n\nAny relevant documentation, such as witness statements or video footage\n\n\n\nStaff workload and job satisfaction\n\n\nUse a Likert scale (e.g. 1-10)\n\nOverall job satisfaction\n\n\nFrequency of feeling stressed or overwhelmed at work\n\n\nSatisfaction with level of support and resources provided by management\n\n\nSatisfaction with level of communication from management\n\n\nSatisfaction with training and professional development opportunities provided\n\n\nSatisfaction with salary and benefits\n\n\nSatisfaction with working conditions\n\n\nSatisfaction with relationships with co-workers and supervisors\n\n\nFeeling safe while working at the facility\n\n\nSatisfaction with level of respect shown by incarcerated persons\n\n\nSatisfaction with support and resources provided to handle difficult situations with incarcerated persons, co-workers, or supervisors\n\n\nLevel of recognition and appreciation received for work\n\n\nLikelihood to recommend facility as a place to work to others\n\n\n\nThe number of hours worked by staff members (measured in hours)\n\n\nThe number and frequency of breaks provided to staff members\n\n\nThe number and frequency of overtime hours worked by staff members (measured in hours)\n\n\nThe number and frequency of staff members who take vacation or personal time (measured in days)\n\n\nThe number and frequency of staff members who call in sick or miss work (measured in occurrences)\n\n\nThe reasons given for sick leave or absenteeism, such as illness, injury, or personal reasons\n\n\n\nPerformance evaluations or assessments\n\n\nAdherence to policies and procedures\n\nnumber of policy violations or deviations observed during a specified time period.\n\n\n\nInterpersonal skills\n\nfeedback from colleagues, or through surveys.\n\n\n\nSafety and security\n\nnumber of security breaches, incidents of violence or disorder, and contraband finds.\n\n\n\nProfessionalism and ethics\n\nthe number of complaints or grievances filed against the officer, as well as the outcomes of any investigations or hearings.\n\n\n\nDocumentation and record-keeping:\n\nMeasure accuracy and completeness of records generated by the officer.\n\n\n\nLeadership and teamwork:\n\nfeedback from colleagues and superiors, as well as through observation of the officer's interactions with other staff members.\n\n\n\nAttendance and punctuality:\n\nnumber of absences and tardiness incidents, as well as the reasons for these occurrences.\n\n\n\nJob knowledge and skills:\n\nPhysical fitness tests\n\n\nFirearms proficiency tests\n\n\nDefensive tactics/Use of Force training and evaluation\n\n\nEmergency response training and evaluation\n\n\nCrisis intervention training and evaluation\n\n\nLegal knowledge and comprehension tests\n\n\nMedical training and evaluation\n\n\nMental health training and evaluation\n\n\nCultural competency and diversity training and evaluation\n\n\nCommunication and de-escalation training and evaluation\n\n\nComputer and technology proficiency tests\n\n\nOfficer's response times\n\n\n\n\n\n\nData on the Conditions\n\nUse of force incidents\n\n\nType of force used (physical, chemical, or other)\n\nMeasure type of force used as a categorical variable (e.g. 1 = physical, 2 = chemical, 3 = other).\n\n\n\nSeverity of force used (minor, moderate, or severe)\n\nMeasure severity of force used as a categorical variable (e.g. 1 = minor, 2 = moderate, 3 = severe).\n\n\n\nThe reason force was used (such as to subdue a violent or disruptive incarcerated person)\n\nMeasure the reason force was used as a categorical variable (e.g. 1 = to subdue a violent incarcerated person, 2 = to subdue a disruptive incarcerated person).\n\n\n\nThe number of staff members involved in the incident\n\nMeasure the number of staff members involved as a numerical variable (e.g. 1, 2, 3, etc.).\n\n\n\nThe number of incarcerated persons involved in the incident\n\nMeasure the number of incarcerated persons involved as a numerical variable (e.g. 1, 2, 3, etc.).\n\n\n\nThe location and time of the incident\n\nMeasure the location and time of the incident as categorical variables (e.g. location = cell block A, time = morning).\n\n\n\nAny injuries sustained by staff or incarcerated persons as a result of the incident\n\nMeasure the number and type of injuries sustained by staff or incarcerated persons as categorical variables (e.g. 1 = no injuries, 2 = minor injuries, 3 = major injuries).\n\n\n\nThe number and types of weapons or tools used by staff members\n\nMeasure the number and types of weapons or tools used as categorical variables (e.g. 1 = baton, 2 = pepper spray, 3 = taser).\n\n\n\nThe number and types of weapons or tools possessed by incarcerated persons during the incident\n\nMeasure the number and types of weapons or tools possessed by incarcerated persons as categorical variables (e.g. 1 = makeshift weapon, 2 = contraband).\n\n\n\nAny disciplinary actions taken against staff members involved in the incident\n\nMeasure the disciplinary action taken as a categorical variable (e.g. 1 = verbal warning, 2 = written warning, 3 = suspension, 4 = termination).\n\n\n\nAny investigations or hearings related to the incident\n\nMeasure the number and outcome of investigations or hearings as categorical variables (e.g. 1 = no investigation, 2 = investigation completed with no findings, 3 = investigation completed with findings).\n\n\n\nAny relevant documentation, such as witness statements or video footage\n\nMeasure the existence and type of documentation as a categorical variable (e.g. 1 = no documentation, 2 = witness statements only, 3 = video footage available).\n\n\n\nThe impact of the incident on the safety and security of the facility and its occupants\n\nMeasure the impact on safety and security as a categorical variable (e.g. 1 = no impact, 2 = minor impact, 3 = major impact).\n\n\n\n\nGrievances and appeals\n\n\nThe number and types of grievances and appeals filed by incarcerated persons\n\n\nThe outcome of each grievance or appeal, such as whether the incarcerated person's complaint was resolved or denied\n\n\nThe length of time it takes to process each grievance or appeal\n\n\nAny investigations or hearings related to the grievance or appeal\n\n\nAny relevant documentation, such as witness statements or video footage\n\n\nAny disciplinary actions taken against staff members as a result of the grievance or appeal\n\n\n\nSegregation and solitary confinement\n\n\nThe number of incarcerated persons who are placed in segregation or solitary confinement, and the reasons for their placement\n\nMeasure the number of incarcerated persons who are placed in segregation or solitary confinement as a numerical variable\n\n\nCategorize the reasons for their placement (e.g. disciplinary, protective custody, administrative)\n\n\n\nThe length of time each incarcerated person spends in segregation or solitary confinement, and any extensions to that time period\n\nMeasure the length of time each incarcerated person spends in segregation or solitary confinement as a numerical variable\n\n\nMeasure any extensions to that time period as a numerical variable\n\n\n\nThe frequency of staff check-ins with incarcerated persons in segregation or solitary confinement\n\n\nThe number and types of interventions provided to incarcerated persons in segregation or solitary confinement, such as counseling or mental health treatment\n\nMeasure the number and types of interventions as a numerical variable\n\n\nCategorize the types of interventions (e.g. counseling, medication management)\n\n\n\n\nLegal resources and representation\n\n\nThe number of incarcerated persons who request legal assistance or representation\n\n\nThe type of legal assistance or representation provided, such as access to a law library or legal counsel\n\nCategorize the type of legal assistance or representation provided (e.g. access to a law library, access to legal counsel, provision of legal forms).\n\n\n\nThe frequency and duration of legal visits or consultations\n\n\n\nCommunity Connections\n\n\nMail\n\n\nnumber and type of mail received and sent\n\n\nRecord the total number of mail screenings\n\n\nnumber of instances where incoming or outgoing mail was confiscated or returned to the sender\n\n\nRecord the total number of prohibited materials found during mail screenings per day/week/month\n\n\nThe frequency and timing of mail delivery to incarcerated persons\n\n\nThe incidents of damaged or lost mail\n\n\nNumber and type of legal mail received and sent per day/week/month\n\n\nThe frequency and intensity of legal mail screenings\n\n\nNumber of instances where legal mail was confiscated or returned to the sender\n\n\nCorrectional officers may be required to annotate information such as the following as they screen and review incoming and outgoing mail:\n\n\nDate and time of screening\n\n\nName and ID number of the incarcerated person whose mail is being screened\n\n\nSender's name and address\n\n\nRecipient's name and address\n\n\nLanguage used in the letter\n\n\nTopics discussed in the letter\n\n\nAny mention of illegal activities or plans\n\n\nAny mention of violence or threats\n\n\nAny mention of contraband or illegal substances\n\n\nAny mention of staff members or other incarcerated persons\n\n\nAny mention of legal matters or pending court cases\n\n\nAny mention of mental health concerns or medical issues\n\n\nAny unusual or suspicious language or behavior used in the letter\n\n\nAny other relevant information that may be useful for the facility's security or investigative purposes\n\n\n\n\n\nPhone\n\n\nThe frequency and duration of phone calls or video visits\n\n\ncosts\n\n\nnumber of phone calls monitored\n\n\nphone monitoring outcomes, annotations\n\nCorrectional officers may be required to annotate information such as the following as they listen to phone calls made by incarcerated persons:\n\n\nDate and time of the call\n\n\nLength of the call\n\n\nPhone number dialed and/or received\n\n\nName of the person dialed and/or received\n\n\nRelationship of the person dialed and/or received to the incarcerated person\n\n\nLanguage spoken during the call\n\n\nTopics discussed during the call\n\n\nAny mention of illegal activities or plans\n\n\nAny mention of violence or threats\n\n\nAny mention of contraband or illegal substances\n\n\nAny mention of staff members or other incarcerated persons\n\n\nAny mention of legal matters or pending court cases\n\n\nAny mention of mental health concerns or medical issues\n\n\nAny unusual or suspicious behavior or language used during the call\n\n\nAny other relevant information that may be useful for the facility's security or investigative purposes\n\n\n\nNumber of cell phones confiscated\n\n\n\nDigital Communications\n\n\nThe number and types of electronic messages sent and received by incarcerated persons, such as emails or text messages\n\n\nThe content and recipients of electronic messages sent and received by incarcerated persons\n\n\nThe costs of the communications and technology to the incarcerated population\n\n\nThe number and types of violations of electronic communication policies and procedures by incarcerated persons\n\n\nThe number and types of investigations or hearings related to electronic communication violations by incarcerated persons\n\n\n\nVisitation\n\n\nVisitation arrival and departure log\n\n\nThe length of each visit (measured in minutes)\n\n\nThe number of visitors per incarcerated person per visit\n\n\nvisitation incidents\n\n\nThe number of visitation incidents resulting in security breaches or escapes\n\n\nThe number of incarcerated persons who are not able to receive visits due to facility policies or restrictions\n\n\n\nMedia Access\n\n\nThe number of incarcerated persons who have access to television programming\n\n\nThe number of incarcerated persons who have access to radio programming\n\n\nThe number of incarcerated persons who have access to newspapers or magazines\n\n\nThe policies and procedures regarding access to media for incarcerated persons\n\n\nThe number of instances where media access was restricted or revoked for incarcerated persons\n\n\nThe reasons for restricting or revoking media access for incarcerated persons\n\n\n\n\nReligious services and materials\n\n\nThe number and frequency of religious services offered to incarcerated persons\n\n\nThe types of religious services offered, such as Christian, Muslim, or Jewish services\n\n\nThe qualifications and experience of chaplains and religious volunteers who lead services\n\n\nThe number of incarcerated persons who participate in each religious service\n\n\nThe availability of religious materials, such as Bibles or prayer rugs\n\n\nThe types of religious materials allowed or prohibited, such as religious texts or religiously themed clothing\n\n\n\nEducation and library resources\n\n\nThe number of incarcerated persons who participate in educational or vocational programs\n\n\nThe types of programs offered, such as GED classes, college courses, or job training\n\n\nThe cost of these programs and the funding sources\n\n\nThe qualifications of the instructors and staff who oversee these programs\n\n\nThe availability of these programs to different groups of incarcerated persons, such as those with disabilities or those in segregation\n\n\nThe incarcerated person's participation and progress in these programs\n\n\nThe number and types of books available in the facility library\n\n\nThe frequency of library access for incarcerated persons\n\n\nThe number of incarcerated persons who borrow books from the library\n\n\nThe qualifications of the librarians who oversee the library\n\n\nThe number of incarcerated persons who participate in educational or vocational programs\n\n\n\n\n\nExercise and recreation opportunities\n\n\nThe number and types of exercise equipment available to incarcerated persons\n\nCount the number of exercise equipment available and categorize them by type (e.g. weights, treadmills, stationary bikes, etc.)\n\n\n\nThe hours of operation of exercise facilities\n\n\nThe number and types of exercise classes or programs offered to incarcerated persons\n\n\nThe availability of outdoor recreation spaces and equipment, such as basketball courts or soccer fields\n\n\nThe hours of operation and accessibility of outdoor recreation spaces\n\nRecord the hours of operation for each outdoor recreation space\n\n\nEvaluate the accessibility of each outdoor recreation space for incarcerated persons with disabilities\n\n\n\nThe number and types of recreational activities available to incarcerated persons, such as board games or arts and crafts\n\n\nThe qualifications of staff who oversee recreational programs\n\n\nThe number of incarcerated persons who participate in recreational programs\n\n\n\n\n\nPersonal hygiene and grooming supplies\n\n\nThe types and quantities of personal hygiene and grooming supplies available to incarcerated persons\n\n\nThe frequency with which personal hygiene and grooming supplies are distributed to incarcerated persons\n\n\nThe cost of personal hygiene and grooming supplies and the funding sources\n\n\nThe availability of specialized personal hygiene and grooming supplies for individuals with specific needs, such as those with disabilities or medical conditions\n\n\nThe number and types of grievances or appeals related to personal hygiene and grooming supplies\n\n\n\n\n\nFood and dietary accommodations\n\n\nThe number and types of meals provided to incarcerated persons each day\n\n\nThe availability of special dietary accommodations, such as vegetarian, kosher, or halal meals\n\n\nThe process for accommodating incarcerated persons with allergies or medical conditions that require special diets\n\n\nThe number and types of grievances or appeals related to food and dietary accommodations\n\n\nThe cultural alignment of food to the incarcerated population\n\nThe number and types of special dietary accommodations for different cultural groups, such as halal or kosher meals\n\n\n\nThe quality of food hygiene\n\nThe frequency of inspections by health inspectors and the results of those inspections\n\n\nThe number of foodborne illness outbreaks and the causes of those outbreaks\n\n\nThe number and types of complaints related to food quality or hygiene\n\n\nThe number and types of grievances or appeals related to food and dietary accommodations\n\n\n\nThe nutritional content of meals provided to incarcerated persons\n\nThe number of calories, protein, vitamins, and minerals provided by each meal\n\n\nThe overall nutritional quality of meals provided to incarcerated persons\n\n\nThe number and types of dietary supplements provided to incarcerated persons, such as vitamins or protein shakes\n\n\n\nThe availability of healthy food options\n\nThe types of healthy food options available, such as fruits and vegetables or whole grains\n\n\n\n\n\n\nMedical and mental health care\n\n\nThe number and types of medications prescribed to incarcerated persons\n\n\nThe number of incarcerated persons who have been diagnosed with a mental health condition\n\n\nThe number of incarcerated persons who receive mental health treatment or counseling\n\n\nThe number of incarcerated persons who have attempted suicide or engaged in self-harm\n\n\nThe number and types of medical and mental health services available to incarcerated persons\n\n\nThe qualifications and experience of medical and mental health staff\n\n\nThe frequency and duration of medical and mental health appointments\n\n\nThe number and types of medical and mental health emergencies\n\n\nThe number and types of grievances or appeals related to medical and mental health care\n\n\nThe number and types of disciplinary infractions related to medical or mental health care, such as refusal to take medication\n\n\nThe number and types of medical procedures performed, such as surgeries or dental work\n\n\nThe number and types of medical tests conducted, such as blood tests or X-rays\n\n\nThe number and types of medical devices used, such as hearing aids or prosthetics\n\n\nThe number of incarcerated persons who have been diagnosed with a chronic medical condition, such as diabetes or asthma\n\n\nThe number of incarcerated persons who have been diagnosed with a communicable disease, such as tuberculosis or HIV/AIDS\n\n\nThe number of incarcerated persons who have received vaccinations or other preventative medical treatments\n\n\nThe number of incarcerated persons who receive palliative or hospice care\n\n\nThe number of incarcerated persons who have been released from custody due to medical reasons\n\n\n\nData on the Facility\n\nStaffing levels and vacancies\n\n\nThe total number of staff employed by the correctional facility\n\n\nThe number of vacancies in various positions, such as correctional officers, medical staff, or administrative staff\n\n\nThe length of time positions have been vacant\n\n\nThe budget allocated for staffing and salaries\n\n\nThe ratio of staff to incarcerated persons\n\n\nThe number of hours worked by staff members\n\n\n\nBudget and expenses\n\n\nThe total budget allocated to the correctional facility\n\n\nThe amount of money spent on food, medical care, and other necessities for incarcerated persons\n\n\nThe cost of maintaining the facility, including utilities and maintenance\n\nThe number and frequency of plumbing issues, such as leaks or clogs\n\n\nThe number and frequency of electrical issues, such as power outages or faulty wiring\n\n\nThe number and frequency of heating and cooling issues, such as malfunctioning HVAC systems or inadequate temperature control\n\n\nThe number and frequency of pest control issues, such as infestations of rodents or insects\n\n\nThe number and frequency of cleaning and sanitation issues, such as spills or unsanitary conditions\n\n\nThe number and frequency of maintenance requests submitted by staff members or incarcerated persons\n\n\nThe number and frequency of maintenance tasks completed by facility maintenance staff\n\n\nThe cost of maintenance and repairs, including materials and labor\n\n\nThe amount of time it takes to complete maintenance tasks or respond to maintenance requests\n\n\nThe frequency of facility inspections by health and safety regulators, and any findings or violations noted during those inspections\n\n\n\nThe cost of staff salaries and benefits\n\n\nThe cost of incarcerated person work programs and other rehabilitative services\n\n\nThe cost of legal fees and court proceedings related to the facility and incarcerated persons\n\n\nThe amount of money saved through incarcerated person labor or other cost-cutting measures\n\nTotal incarcerated persons assigned to work and number of hours worked for all positions including:\n\n\nManufacturing workers\n\n\nCustodial workers\n\n\nLaundry workers\n\n\nFood service employees\n\n\nGroundskeepers\n\n\nJanitorial workers\n\n\nMaintenance workers\n\n\nAdministrative workers\n\n\nConstruction workers\n\n\nEquipment operators\n\n\nCustomer service representatives\n\n\nAgricultural workers\n\n\nLandscaping workers\n\n\nPainters\n\n\nClerical workers\n\n\nTutoring/teaching staff\n\n\nVocational training workers\n\n\n\n\n\n\nMaintenance and Operations\n\n\nFacility safety and security measures, such as cameras and alarms\n\nSupplies needed for any state department operation:\n\n\nOffice supplies (e.g. pens, paper, staplers)\n\n\nComputers and other electronic devices\n\n\nCleaning supplies (e.g. disinfectants, brooms, mops)\n\n\nFirst aid kits and medical supplies\n\n\nFire extinguishers and other fire safety equipment\n\n\nSafety equipment (e.g. hard hats, safety glasses, gloves)\n\n\nTools and equipment for maintenance and repairs\n\n\nFurniture (e.g. chairs, desks, filing cabinets)\n\n\nVehicles for transportation\n\n\nFuel for vehicles and generators\n\n\nLighting supplies (e.g. light bulbs, lamps)\n\n\nHeating, ventilation, and air conditioning (HVAC) supplies\n\n\nSupplies needed specifically for corrections agencies:\n\n\nRestraints (e.g. handcuffs, leg irons)\n\n\nRiot gear (e.g. shields, helmets)\n\n\nLess lethal weapons (e.g. pepper spray, tasers)\n\n\nFirearms and ammunition\n\n\nBody armor and protective equipment\n\n\nLocks and keys for cells and other secure areas\n\n\nFencing and other barriers for security purposes\n\n\nCleaning supplies specific to correctional settings (e.g. disinfectants for cells and common areas)\n\n\nPersonal hygiene and grooming supplies for incarcerated persons (e.g. soap, toothbrushes, razors)\n\n\nFood and dietary supplies for incarcerated persons (e.g. food, utensils, trays)\n\n\nMedical and mental health supplies (e.g. medication, medical equipment, therapy materials)\n\n\nEducational and vocational supplies (e.g. textbooks, computer equipment, tools for vocational training)\n\n\nExercise and recreational equipment (e.g. weights, sports equipment, board games)\n\n\nClothing and bedding for incarcerated persons (e.g. uniforms, sheets, blankets)\n\n\n\nMaintenance and repair records for equipment and infrastructure\n\n\nEnvironmental health and safety measures, such as air quality and waste management\n\n\nCleaning and sanitation procedures and schedules\n\n\nEmergency response plans and drills\n\n\n\nData on the Incarcerated Population\n\nPopulation by facility and/or housing unit\n\n\nDemographic information (age, gender, race, etc.)\n\n\nCriminal history and offense type\n\n\nSentence length and time served\n\n\nGang affiliation and security threat level\n\n\nWork assignments\n\n\nVisitors and visitation schedules\n\n\nRelease and parole eligibility dates\n\n\n\nLength of stay and time served\n\n\nTotal length of stay in the correctional facility\n\n\nTime served for current offense\n\n\nTime remaining in sentence\n\n\nTime credited for good behavior or participation in programs\n\n\n\nOffense type and severity\n\n\nThe specific offense committed\n\n\nThe severity of the offense, such as a felony or misdemeanor\n\n\nThe number of offenses committed\n\n\nWhether the offense was committed while the incarcerated person was on parole or probation\n\n\n\nParole eligibility and release dates\n\n\nThe date the incarcerated person is first eligible for parole\n\n\nThe date of the incarcerated person's next parole hearing\n\n\nThe incarcerated person's release date, if known\n\n\nThe conditions of the incarcerated person's parole, such as supervision requirements or drug testing\n\n\n\nDisciplinary infractions and sanctions\n\n\nThe type of infraction committed, such as assault or possession of contraband\n\n\nThe date and location of the infraction\n\n\nThe sanctions imposed, such as loss of privileges or segregation\n\n\nAny appeals or grievances filed by the incarcerated person regarding the infraction or sanctions\n\n\n\nClassification and custody levels\n\n\nThe incarcerated person's custody level, such as minimum, medium, or maximum security\n\n\nThe incarcerated person's classification level, such as minimum, medium, or maximum risk\n\n\nThe incarcerated person's housing assignment and location within the facility\n\n\nAny special needs or accommodations the incarcerated person requires, such as medical or mental health treatment\n\n\n\nFinances\n\n\nThe amount of money in each incarcerated person's account\n\n\nThe sources of each incarcerated person's income, such as wages earned through work programs or funds deposited by family members\n\n\nThe amount of money spent by incarcerated persons on commissary items, such as snacks or toiletries\n\n\nThe amount of money spent by incarcerated persons on forms of communication\n\n\nThe amount of money spent by incarcerated persons on legal fees or court costs\n\n\nThe amount of money spent by incarcerated persons on medical or mental health care, including copays or deductibles\n\n\nThe amount of money spent by incarcerated persons on educational or vocational programs, such as college courses or job training\n\n\nThe amount of money saved by incarcerated persons through participation in savings programs or other financial education initiatives\n\n\nThe amount of debt owed by incarcerated persons, such as unpaid fines or court-ordered restitution\n\n\nThe number and types of grievances or appeals related to financial issues, such as disputes over account balances or unauthorized charges\n\n\nThe amount of money each incarcerated person is released into the world with upon EOS\n\n\nThe fees implemented by the corrections agency on the incarcerated\n\n\n\n\nData on Transportation\n\n\nThe number of vehicles owned by the department of corrections\n\n\nThe age and condition of each vehicle\n\n\nThe total mileage driven by each vehicle\n\n\nThe fuel efficiency of each vehicle\n\n\nThe total cost of vehicle maintenance and repairs\n\n\nThe number of accidents involving department of corrections vehicles\n\n\nThe cost of insurance for department of corrections vehicles\n\n\nThe number and frequency of vehicle inspections\n\n\nThe number of incarcerated persons transported by the department of corrections\n\n\nThe distance traveled per transport\n\n\nThe duration of each transport\n\n\nThe number of staff members involved in each transport\n\n\nThe number and types of restraints used during each transport\n\n\nThe number and types of incidents that occur during transports, such as fights or medical emergencies\n\n\nThe number of incarcerated persons who are transported to court or other facilities for legal proceedings\n\n\nThe number of incarcerated persons who are injured or killed during transport\n\n\nThe number of incidents of excessive use of force or violence by correctional officers during transport\n\n\nThe number of incidents of sexual misconduct or assault by correctional officers during transport\n\n\nThe number of incidents of racial or other forms of discrimination or bias during transport\n\n\nThe number of incidents of retaliation or punishment against incarcerated persons during transport, such as for filing grievances or complaints\n\n\nThe number of incidents of inadequate medical care or treatment during transport\n\n\nThe number of incidents of inadequate mental health care or treatment during transport\n\n\nThe number of incidents of physical or emotional trauma experienced by incarcerated persons during transport\n\n\nThe number of grievances or complaints filed by incarcerated persons related to transportation, including the outcomes of those grievances or complaints\n\n\nThe number of lawsuits filed against the department of corrections related to transportation, including the outcomes of those lawsuits\n\n\nThe number of staff members involved in each transport, and any patterns or disparities related to staff demographics or behavior\n\n\n\nData on COVID\n\n\nNumber of COVID cases among incarcerated persons and staff members\n\n\nNumber of COVID-related hospitalizations and deaths among incarcerated persons and staff members\n\n\nNumber of COVID tests administered to incarcerated persons and staff members, and the percentage of positive results\n\n\nNumber and type of COVID-related safety measures implemented within the facility, such as PPE distribution, testing protocols, and social distancing guidelines\n\n\nNumber and type of COVID-related safety measures implemented during transport of incarcerated persons, such as testing prior to transport and use of PPE\n\n\nNumber and type of COVID-related safety measures implemented during visitation, such as testing requirements and social distancing guidelines\n\n\nNumber and type of COVID-related safety measures implemented for staff members, such as PPE distribution and testing protocols\n\n\nNumber and type of COVID-related safety measures implemented for incarcerated persons with special needs or medical conditions\n\n\nNumber and type of COVID-related safety measures implemented for newly arriving incarcerated persons, such as quarantine protocols and testing requirements\n\n\nNumber and type of COVID-related safety measures implemented for incarcerated persons nearing release, such as testing protocols and access to vaccines\n\n\nCost of COVID-related safety measures, including testing, PPE, and other resources\n\n\n\nData from Sensors/IOT\n\n\nData from fence controls and sensors:\n\nNumber and frequency of fence breaches or attempted breaches\n\n\nTime and location of fence breaches or attempted breaches\n\n\nNumber and types of disciplinary infractions related to fence breaches or attempted breaches\n\n\nNumber and types of investigations or hearings related to fence breaches or attempted breaches\n\n\n\nData from temperature sensors:\n\nTemperature readings in different areas of the facility, including housing units, medical areas, and administrative areas\n\n\n\nData from maintenance records\n\n\nData from perimeter sensors:\n\nMotion detection\n\n\nHeat detection\n\n\nNoise detection\n\n\nVibration detection\n\n\nPressure detection\n\n\nLight detection\n\n\nMagnetic field detection\n\n\nInfrared detection\n\n\nRadio frequency detection\n\n\nUltrasonic detection\n\n\nVideo surveillance footage\n\n\n\n\n\nRelevant Public Data\n\n\nEnvironmental conditions:\n\nAir quality measurements near correctional facilities\n\n\nTemperature and humidity data for correctional facilities\n\n\nGeographic data on proximity to natural resources, such as water and forests\n\n\nWeather data, including precipitation and extreme weather events\n\n\n\nPolitical conditions:\n\nNumber of registered voters in the area surrounding a correctional facility\n\n\nVoter turnout rates in local and state elections\n\n\nCrime rates and trends in surrounding communities\n\n\nPresence and influence of advocacy groups and organizations focused on criminal justice reform\n\n\n\nEconomic conditions:\n\nLocal and state economic indicators, such as employment rates and GDP\n\n\nIncome and poverty levels in surrounding communities\n\n\nAvailability and accessibility of public transportation for families visiting incarcerated persons\n\n\nCost of living in surrounding communities\n\n\nAvailability and accessibility of affordable housing\n\n\n\nHealth conditions:\n\nPrevalence rates of chronic diseases and mental health conditions in surrounding communities\n\n\n\nDemographic conditions:\n\nRacial and ethnic makeup of surrounding communities\n\n\nImmigration status and history of surrounding communities\n\n\nEducational attainment levels in surrounding communities\n\n\nAge and gender distributions in surrounding communities\n\n\nHousing stability\n\n\n\nLegal conditions:\n\nNumber and type of lawsuits filed against the correctional facility or department of corrections\n\n\n\nSocial conditions:\n\nAvailability and accessibility of support services and programs for formerly incarcerated individuals\n\n\nPresence and influence of community organizations and advocacy groups focused on criminal justice reform\n\n\n\nEducational conditions:\n\nSchool district data: School districts often collect and report data on student enrollment, graduation rates, standardized test scores, and other educational outcomes. This data can be used to understand educational conditions in a specific school district.\n\n\nNational and state assessments: The National Assessment of Educational Progress (NAEP) and state-level assessments provide data on student achievement in specific subjects and grade levels. This data can be used to understand educational conditions at the national and state levels.\n\n\n\n\nSome potential studies which follow\n\n\nUsing:\n\n\nData on the Staff\n\n\nAnalyze the time spent waiting at gates and security points, in minutes, according to position, rank, role, gender, and sex, compare to civilian and incarcerated person wait times.\n\n\nInvestigate the impact of prison staff turnover on incarcerated persons' mental health and overall well-being, based on demographic information and offense type.\n\n\nAnalyze the relationship between correctional officers' use of force and rates of disciplinary infractions, violence, and disorder among incarcerated persons, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of staff training programs in reducing rates of disciplinary infractions and improving overall well-being for incarcerated persons with mental health conditions, based on demographic information and offense type.\n\n\nInvestigate the relationship between staff demographics and behavior (e.g. gender, race, age) and rates of violence, disorder, and discrimination among incarcerated persons, based on demographic information and offense type.\n\n\nAnalyze the relationship between staff demographics and behavior (e.g. gender, race, age) and rates of use of force, disciplinary infractions, and violence among incarcerated persons, based on demographic information and offense type.\n\n\nAnalyze the impact of different types of staff-to-inmate ratios on rates of violence, disorder, and illness among incarcerated persons, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of staff accountability measures, such as body cameras or internal affairs investigations, in reducing rates of staff misconduct and improving overall well-being for incarcerated persons, based on demographic information and offense type.\n\n\nInvestigate the impact of different types of staff training programs in reducing the use of restraints and segregation on incarcerated persons, based on demographic information and offense type.\n\n\nAnalyze patterns in the use of force by correctional officers to identify potential instances of sexual abuse or harassment, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of staff training programs in reducing rates of staff misconduct and improving overall well-being for incarcerated persons with disabilities, based on demographic information and offense type.\n\n\nInvestigate the impact of prison staff morale on incarcerated persons' mental health and overall well-being, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of staff training programs in reducing rates of staff misconduct and improving overall well-being for incarcerated persons with substance use disorders, based on demographic information and offense type.\n\n\nAssess the impact of different types of staffing models, such as private vs. public, on rates of disciplinary infractions, overall well-being, and cost-effectiveness.\n\n\n\nData on the Conditions\n\n\nInvestigate the impact of prison population size on incarcerated persons' mental health and overall well-being, based on demographic information and offense type.\n\n\nAnalyze the relationship between facility age, maintenance, and conditions (e.g. cleanliness, temperature) and rates of illness, injury, and disorder among incarcerated persons, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of facility security measures, such as cameras or alarms, in reducing rates of violence, disorder, and illness among incarcerated persons, based on demographic information and offense type.\n\n\nInvestigate the impact of different types of environmental health and safety measures, such as air quality or waste management, on incarcerated persons' physical health and overall well-being, based on demographic information and offense type.\n\n\nAnalyze patterns in facility disciplinary infractions and sanctions to identify potential instances of discrimination or bias, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of facility maintenance and repair programs in reducing rates of illness, injury, and disorder among incarcerated persons, based on demographic information and offense type.\n\n\nInvestigate the relationship between facility age and conditions and rates of self-harm and suicide among incarcerated persons, based on demographic information and offense type.\n\n\nAnalyze the impact of different types of facility visitation policies and restrictions on incarcerated persons' mental health and overall well-being, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of facility cleaning and sanitation procedures in reducing rates of illness and injury among incarcerated persons, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of drug treatment programs in reducing rates of drug-related disciplinary infractions and improving overall well-being, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' access to educational and vocational programs and their likelihood of finding employment upon release, based on demographic information and offense type.\n\n\nAssess the impact of different types of visitation policies and restrictions on incarcerated persons' relationships with family and friends, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' access to medical care and their likelihood of developing chronic medical conditions or experiencing preventable deaths, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' housing conditions and access to basic necessities (e.g. food, water, hygiene supplies), and their physical health and overall well-being, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' access to medical care and their overall physical health and well-being, based on demographic information and offense type.\n\n\nInvestigate the impact of solitary confinement on incarcerated persons' mental health and overall well-being, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' access to mental health services and their likelihood of receiving diagnoses or treatment, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' access to medical care and their likelihood of developing chronic medical conditions or experiencing preventable deaths, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' work assignments and overall well-being, based on demographic information and offense type.\n\n\nAssess the impact of different types of environmental health and safety measures, such as air quality and waste management, on overall well-being and disciplinary infractions, based on demographic information and offense type.\n\n\n\nData on the Incarcerated Population\n\n\nAnalyze the relationship between incarcerated persons' demographic information (age, gender, race, etc.) and rates of disciplinary infractions, mental health diagnoses, and chronic medical conditions. (do not do this, plz)\n\n\nInvestigate the relationship between incarcerated persons' criminal history and offense type and rates of disciplinary infractions and overall well-being.\n\n\nAnalyze the relationship between incarcerated persons' gang affiliation and security threat level and rates of disciplinary infractions, violence, and disorder.\n\n\nAnalyze the relationship between incarcerated persons' sentence length and time served and rates of disciplinary infractions, overall well-being, and job prospects upon release.\n\n\nInvestigate the relationship between incarcerated persons' offense type and severity and rates of disciplinary infractions, overall well-being\n\n\nAnalyze the relationship between incarcerated persons' custody level and rates of disciplinary infractions, violence, and disorder, based on demographic information and offense type.\n\n\n\nData on the Facility\n\n\nAnalyze the relationship between the use of restraints on incarcerated pregnant persons and rates of maternal and fetal health complications, based on demographic information and offense type.\n\n\nAssess the impact of different types of disciplinary interventions, such as loss of visitation privileges or placement in isolation, on rates of self-harm and suicide, based on demographic information and offense type.\n\n\nAssess the impact of different types of disciplinary interventions, such as solitary confinement or loss of privileges, on rates of violence and disorder, based on demographic information and offense type.\n\n\nAnalyze patterns in the use of restraints and segregation on incarcerated persons with disabilities to identify potential instances of discrimination and violations of disability rights, based on demographic information and offense type.\n\n\nAssess the impact of different types of visitation policies and restrictions on incarcerated persons' mental health and overall well-being, based on demographic information and offense type..\n\n\nEvaluate the effectiveness of different types of mental health services in reducing rates of disciplinary infractions and improving overall well-being for incarcerated persons with mental health diagnoses, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of drug treatment programs in reducing rates of drug-related disciplinary infractions and improving overall well-being, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of mental health services in reducing rates of disciplinary infractions and improving overall well-being for incarcerated persons with substance use disorders, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of security measures, such as cameras and alarms, in reducing incidents of violence and disorder.\n\n\nInvestigate the relationship between incarcerated persons' housing assignment and location within the facility and rates of disciplinary infractions and overall well-being.\n\n\nAssess the impact of different types of work programs and rehabilitative services on rates of disciplinary infractions, job prospects upon release, and overall well-being.\n\n\nAnalyze the relationship between incarcerated persons' work assignments and recidivism rates, based on demographic information and offense type.\n\n\nInvestigate the relationship between incarcerated persons' visitation schedules and overall well-being, based on demographic information and offense type.\n\n\nAssess the impact of different types of medical and mental health services, such as palliative or hospice care, on end-of-life outcomes for incarcerated persons, based on demographic information and offense type.\n\n\nAssess the impact of different types of recreational activities on overall well-being and disciplinary infractions, based on demographic information and offense type.\n\n\nEvaluate the effectiveness of different types of personal hygiene and grooming supplies in reducing rates of disciplinary infractions and improving overall well-being, based on demographic information and offense type.\n\n\n\nData on Transportation\n\n\nThe gender breakdown of incarcerated persons transported, and any disparities or patterns related to gender\n\n\nThe racial and ethnic breakdown of incarcerated persons transported, and any disparities or patterns related to race or ethnicity\n\n\nThe age breakdown of incarcerated persons transported, and any disparities or patterns related to age\n\n\nThe length and frequency of transport trips, and any negative impacts on the physical or mental health of incarcerated persons\n\n\nThe cost of transportation, including the cost of fuel, maintenance, repairs, and insurance, as well as any cost savings or cost-cutting measures\n\n\nThe training and qualifications of staff members involved in transport, and any patterns or disparities related to staff education or experience\n\n\nA study of the mental and physical health impacts of transportation, with a focus on vulnerable populations such as pregnant women, elderly persons, or those with disabilities\n\n\nAn investigation of incidents of violence, discrimination, and abuse during transportation, and the policies and practices that contribute to these incidents\n\n\nAn examination of the cost of transportation, including the cost of maintaining and operating vehicles, and the potential for cost savings through alternative transportation methods or reduced incarceration rates\n\n\nAn analysis of the training and qualifications of staff members involved in transportation, and the potential for improved staff education and training to reduce incidents of harm or abuse during transport\n\n\nA comparison of transportation practices and outcomes across different correctional facilities or states\n\n\nA study of the impact of transportation on recidivism rates, and the potential for improved transportation practices to reduce recidivism and improve reentry outcomes.\n\n\n\nRelated Public Data\n\n\nA study of the relationship between rates of chronic medical conditions and environmental factors such as air quality and proximity to natural resources, based on demographic information and offense type.\n\n\nAn investigation of the impact of environmental factors such as temperature and weather events on mental health outcomes for incarcerated persons, based on demographic information and offense type.\n\n\nAn analysis of the relationship between political conditions such as voter turnout rates and crime trends, and rates of violence, disorder, and illness among incarcerated persons, based on demographic information and offense type.\n\n\nA study of the impact of economic conditions such as employment rates and income levels on the physical health and overall well-being of incarcerated persons, based on demographic information and offense type.\n\n\n\n\n\n\nIf We Knew\n\n\nIf all types of data that the Department of Corrections tracks for its own administrative use were free and accessible to all persons, it would empower different groups in various ways to mitigate the harmful aspects of incarceration. Here are some examples:\n\n\nIncarcerated Persons:\n\nAccess to data on the number and types of disciplinary actions taken against staff members, as well as the outcomes of those actions. This data would allow incarcerated persons to hold staff members accountable for their actions and to advocate for more effective disciplinary policies.\n\n\nAccess to data on the number and types of educational and vocational programs offered to incarcerated persons, as well as the qualifications of the instructors and staff who oversee those programs. This data would allow incarcerated persons to make informed decisions about their education and career paths, and to advocate for more diverse and effective educational programs.\n\n\nAccess to data on the number and types of medical and mental health services available to incarcerated persons, as well as the qualifications and experience of the medical and mental health staff. This data would allow incarcerated persons to advocate for improvements to the quality and availability of medical and mental health care, and to better understand their own health needs and options.\n\n\nAccess to data on the number and types of grievances or appeals filed by incarcerated persons, as well as the outcomes of those grievances or appeals. This data would allow incarcerated persons to better understand their rights and legal protections, and to advocate for changes in policies or practices that are unfair or unjust.\n\n\nAccess to data on mail impoundment rates for contraband, as it could provide incarcerated individuals with a means of protesting new mail policies that may be driven by corporate interests seeking to sell restricted digital access or tablets.\n\n\nAccess to data on the cost of labor and the amount of money saved by the correctional facility through incarcerated labor. This data would allow incarcerated persons to negotiate for better wages and working conditions, and to advocate for more equitable labor policies.\n\n\nAccess to data on the quality of food hygiene, the nutritional content of meals provided to incarcerated persons, and the availability of healthy food options. This data would allow incarcerated persons to advocate for improvements to the quality and nutritional value of the food they are served.\n\n\nAccess to data on the use of force incidents, the reasons for their use, and the number of staff members involved. This data would allow incarcerated persons to hold staff members accountable for their actions and to advocate for more effective and humane use of force policies.\n\n\nAccess to data on the number and types of weapons or tools used by staff members during use of force incidents. This data would allow incarcerated persons to advocate for restrictions on the use of certain weapons or tools that are particularly dangerous or prone to abuse.\n\n\nAccess to data on the number and types of investigations or hearings related to use of force incidents. This data would allow incarcerated persons to hold staff members accountable for their actions and to advocate for more effective investigation and disciplinary policies.\n\n\nAccess to data on the number and types of recreational activities available to incarcerated persons, as well as the qualifications of staff who oversee recreational programs. This data would allow incarcerated persons to advocate for more diverse and engaging recreational activities.\n\n\nAccess to data on the availability of specialized personal hygiene and grooming supplies for individuals with specific needs, such as those with disabilities or medical conditions. This data would allow incarcerated persons to advocate for more equitable access to these supplies.\n\n\nAccess to data on the types of religious services offered, the qualifications and experience of chaplains and religious volunteers who lead services, and the availability of religious materials. This data would allow incarcerated persons to advocate for more diverse and inclusive religious services and resources.\n\n\nAccess to data on the frequency of phone calls or video visits, the costs, and the number of phone calls monitored. This data would allow incarcerated persons to advocate for more affordable and accessible communication options with their loved ones.\n\n\nUniversity and College Instructors\n\n\nAccess to data on the number and types of disciplinary actions taken against staff members: This data could be used to hold staff members accountable for their actions and to advocate for more effective disciplinary policies. Instructors could use this information to help their students better understand the disciplinary process and to advocate for their rights. They could also use this information to better understand the conditions faced by their students and to connect with them more deeply.\n\n\nAccess to data on the number and types of educational and vocational programs offered to incarcerated persons: This data could be used to help instructors better understand the educational opportunities available to their students and to advocate for more diverse and effective educational programs. Instructors could use this information to help their students make informed decisions about their education and career paths.\n\n\nAccess to data on the number and types of medical and mental health services available to incarcerated persons: This data could be used to help instructors better understand the health needs of their students and to advocate for improvements to the quality and availability of medical and mental health care. Instructors could use this information to better support their students' health and well-being.\n\n\nAccess to data on the number and types of grievances or appeals filed by incarcerated persons: This data could be used to help instructors better understand the legal protections available to their students and to advocate for changes in policies or practices that are unfair or unjust. Instructors could use this information to help their students advocate for their rights and to better understand the legal system.\n\n\nAccess to data on the cost of labor and the amount of money saved by the correctional facility through incarcerated labor: This data could be used to help instructors better understand the labor conditions faced by their students and to advocate for more equitable labor policies. Instructors could use this information to help their students negotiate for better wages and working conditions.\n\n\nAccess to data on the quality of food hygiene, the nutritional content of meals provided to incarcerated persons, and the availability of healthy food options: This data could be used to help instructors better understand the dietary needs of their students and to advocate for improvements to the quality and nutritional value of the food they are served. Instructors could use this information to better support their students' health and well-being.\n\n\nAccess to data on the types of religious services offered, the qualifications and experience of chaplains and religious volunteers who lead services, and the availability of religious materials: This data could help instructors better understand the religious needs of their students and advocate for more diverse and inclusive religious services and resources. Instructors could use this information to better support their students' spiritual and emotional well-being.\n\n\nAccess to data regarding educational resources such as books can also help educators understand the availability and accessibility of these resources to incarcerated persons. They can use this information to advocate for more comprehensive and diverse educational materials that better meet the needs of the student population.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2023-09-25T11:41:35-04:00",
    "input_file": {}
  },
  {
    "path": "work/2023-09-19-mortality/",
    "title": "Investigation of FDOC Public 'Inmate Mortality Data'",
    "description": "The Florida Department of Corrections hosts a webpage called \"Inmate Mortality\" on their website; this document is an ONGOING mining of that data. (note -- I will be adding downloadable files of initial data as well as intermediate stages of data cleaning within the coming days)",
    "author": [],
    "date": "2023-09-22",
    "categories": [],
    "contents": "\n\nContents\nThe Raw Data\nLake Butler Medical Reception Center\nHomicides\nHomicides By Facility\n\nAccidental Deaths\nAccidental Deaths by Facility\n\nNatural Deaths\nGroupings Across Space, Natural Deaths\n2015\nDecember 2015\n\n2016\nJanuary 2016\nFebruary 2016\nJune 2016\nJuly 2016\n\n2018\nJanuary 2018\nFebruary 2018\nMarch 2018\nMay 2018\nOctober 2018\n\n2019\nJanuary 2019\nJuly 2019\n\n2020\nFebruary 2020\nSeptember 2021\nOctober 2021\nDecember 2021\n\n2022\nJanuary 2022\nApril 2022\nMay 2022\nJune 2022\nSeptember 2022\nDecember 2022\n\n2023\nFebruary 2023\n\n\n\nThe Florida Department of Corrections hosts a webpage called “Inmate Mortality” on their website. This page lists all deaths that occurred throughout the department during the preceding fiscal year. The webpage provides data for fiscal years 2017-2018 up to the present and can be accessed at Inmate Mortality – Florida Department of Corrections (myflorida.com).\n\n\n\nFigure 1: Source: Screenshot 2023-09-04 at 11.27.33 AM | Florida Department of Corrections\n\n\n\n\n\nFigure 2: Source: Screenshot 2023-09-04 at 11.34.04 AM | Florida Department of Corrections\n\n\nIt is remarkable and surprising that the FDOC chose to openly post this data (this point requires further support). In my data science training, however, I have learned that data is usually presented in this way only when there is a story to tell or a point to make. By presenting the data in this way, it becomes a communication tool, and one story in partiular has been intentionally centered here by the Florida Department of Corrections: the vast majority of deaths inside are “natural,” which is listed first under “Mortality Facts” and emphasized through the use of a pie chart. The third item in this list of “facts” serves to reinforce this point, and the table of the number of deaths separated by manner of death presented alongside this visual is used as an opportunity to juxtapose the total inmate population. The FDOC’s story is clear: given such a large incarcerated population entering with pre-existing medical conditions, natural deaths are inevitable but slight in comparison to the total number of persons under their care.\n\n“On average, people should be more skeptical when they see numbers. They should be more willing to play around with the data themselves.” – Nate Silver, founder, and editor-in-chief of FiveThirtyEight.\n\nFortunately, in addition to these summary statistics, the FDOC also posts tables of deaths, and these raw data are quite informative.\n\n\n\nFigure 3: Source: Screenshot 2023-09-04 at 12.20.33 PM | Florida Department of Corrections\n\n\nThis paper utilizes these lists for the fiscal years 2015 - present. Although the webpage itself only links to data tables going back to the FY 2017-2018, the FDOC has been publishing said tables since 2015, and links to the fiscal years 2015-16. and 2017-18 were made available to the author via a direct request to the FDOC’s Department of Research and Data.\nThe Raw Data\nWhile many records lack names and the manner of death, the FDOC data does contain 3,497 death observations, each of which is accompanied by a “Date of Death”. The earliest recorded date of death is July 2nd, 2015, and the latest is July 31st, 2023. To begin, I have compiled the data into a sortable and searchable data table.\n\n\nCoding work and downloadable initial and intermediate data are visible under the toggle sections for each subtask:\n\n\n\nImporting libraries, setting seed\n\n\n\npkgs = c(\"tidyverse\",\n         \"ggplot2\",\n         \"kableExtra\",\n         \"outliers\",\n         \"boot\",\n         \"forcats\",\n         \"DT\",\n         \"plotly\",\n         \"gridExtra\",\n         \"leaflet\",\n         \"htmltools\",\n         \"purrr\",\n         \"RColorBrewer\",\n         \"readxl\",\n         \"waffle\",\n         \"ggforce\",\n         \"viridis\")\ninst = lapply(pkgs, library, character.only = TRUE)\nset.seed(8675309)\n\n\n\n\n\n\nReading in csv files\n\nYou can download the initial csv files here: Download fdoc_mortality.zip.\n\n\n# Here we are bringing in our csv files -- I copied and pasted the FDOC tables into spreadsheets and saved them as csvs. The coordinates of FDOC facilities were manually looked up by me on Google maps.\n\n# base directory for CSV files\nbase_dir <- \"/Users/johnwise/pubic_repository/csvs/fdoc_mortality/\"\n\n# Define a function to read and preprocess CSV files\nread_and_preprocess_csv <- function(file_path) {\n  # Read the CSV file\n  data <- read_csv(file_path, col_names = TRUE, skip = 1, show_col_types = FALSE)\n  \n  # Extract 'DC Number' using regular expression\n  data$`DC Number` <- str_extract(data$`DC Number`, \"(?<=DCNumber=)[^&]+\")\n  \n  return(data)\n}\n\n# Read and preprocess CSV files for each fiscal year\nfy15 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2015-2016.csv\"))\nfy16 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2016-2017.csv\"))\nfy17 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2017-2018.csv\"))\nfy18 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2018-2019.csv\"))\nfy19 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2019-2020.csv\"))\nfy20 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2020-2021.csv\"))\nfy21 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2021-2022.csv\"))\nfy22 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2022-2023.csv\"))\nfy23 <- read_and_preprocess_csv(paste0(base_dir, \"FY 2023-2024.csv\"))\n\n# Brining in Facility coordinates, manually acquired (someone should double check these!) by the author\ncords <-read_csv(paste0(base_dir, 'facility_cords.csv'))\n\n\n\n\n\n\nData cleaning\n\n\n\n# Combine data frames from different fiscal years into one\ndeaths <- rbind(fy15, fy16, fy17, fy18, fy19, fy20, fy21, fy22, fy23)\n\n# Remove individual fiscal year data frames to free up memory\nremove(fy15, fy16, fy17, fy18, fy19, fy20, fy21, fy22, fy23)\n\n# Rename columns for consistency and clarity\ncolnames(deaths) <- c('Name', 'DCNumber', 'Date_Death', 'FACILITY_description', 'Manner_Death', 'Status')\n\n# Extract the first word from the 'Status' column\ndeaths$Status <- str_extract(deaths$Status, \"^\\\\S+\")\n\n# Convert the 'Date_Death' column to Date format (assuming 'mdy' function from lubridate)\ndeaths$Date_Death <- as.Date(mdy(deaths$Date_Death))\n\n# Convert selected columns to factor variables for categorical data\ndeaths$FACILITY_descriptionn <- as.factor(deaths$FACILITY_description)\ndeaths$Manner_Death <- as.factor(deaths$Manner_Death)\ndeaths$Status <- as.factor(deaths$Status)\ndeaths$DCNumber <- as.factor(deaths$DCNumber)\n\nwrite_csv(deaths, 'deaths1.csv')\n\n\nYou can download this cleaned data as an csv file here: Download deaths1.csv.\n\n\n# Manner of Death\ndeaths$Manner_Death <- recode(deaths$Manner_Death, \"Natrual\" = \"Natural\")\ndeaths$Manner_Death <- recode(deaths$Manner_Death, \"CLOSED\" = \"Closed\")\ndeaths$Manner_Death <- recode(deaths$Manner_Death, \"4Suicide\" = \"Suicide\")\ndeaths$Manner_Death <- recode(deaths$Manner_Death, \"Acdident\" = \"Suicide\")\n\n# Facilities\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Apalachee East\" = \"APALACHEE EAST UNIT\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"BAKER Re-Entry\" = \"BAKER RE-ENTRY CENTR\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Blackwater CF\" = \"BLACKWATER C.F.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"CFRC\" = \"CFRC-MAIN\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"CFRC East\" = \"CFRC-EAST\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"CFRC South\" = \"CFRC-SOUTH\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"COLUMBIA C.I.\" = \"COLUMBIA CI\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Charlotte\" = \"CHARLOTTE C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Cross City\" = \"CROSS CITY C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"FSP West\" = \"FSP WEST UNIT\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Hamilton Annex\" = \"HAMILTON ANNEX\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Hardee\" = \"HARDEE C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Hardee Work Camp\" = \"HARDEE WORK CAMP\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"LAKE CITY\" = \"LAKE CITY C.F.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Lake\" = \"LAKE C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Marion\" = \"MARION C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Okeechobee\" = \"OKEECHOBEE C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"RMC-Main Unit\" = \"R.M.C.- MAIN UNIT\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"R.M.C.-MAIN UNIT\" = \"R.M.C.- MAIN UNIT\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"S.F.R.C\" = \"S.F.R.C.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"S.F.R.C. SOUTH\" = \"S.F.R.C. SOUTH UNIT\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"SFRC\" = \"S.F.R.C.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"SUMTER  C.I.\" = \"SUMTER C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Suwannee Annex\" = \"SUWANNEE C.I. ANNEX\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Taylor\" = \"TAYLOR C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Union\" = \"UNION C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Wakulla\" = \"WAKULLA C.I.\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Wakulla Annex\" = \"WAKULLA ANNEX\")\ndeaths$FACILITY_description <- recode(deaths$FACILITY_description, \"Walton\" = \"WALTON C.I.\")\n\n# there are three records for which the cause of death was determined to be 'Undetermined' and three records for which this variable was valued as 'Closed'. This \"Closed\" is meant to be a category for investigative status, so for the purposes of this investigation we collapse those categorized as \"Closed\" to be \"Undetermined\".\ndeaths$Manner_Death <-  recode(deaths$Manner_Death, \"Closed\" = \"Undetermined\")\n\nwrite_csv(deaths, 'deaths2.csv')\n\n\nYou can download this cleaned data as an csv file here: Download deaths2.csv.\n\n\n\n\nShow code\n\n# Creating the table utilizing the data imported and cleaned above\nfacilities <- deaths %>% \n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>%\n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  mutate(total = sum(Natural,Suicide, Accident)) %>%\n  arrange(desc(total))\ndatatable(facilities, options = list(scrollX = TRUE, pageLength = 10, lengthMenu = c(10, 20, 50)))\n\n\n\nShow code\n\nwrite_csv(facilities, 'facilities.csv')\n\n\nYou can download this cleaned and aggregated data as an csv file here: Download facilities.csv.\nLake Butler Medical Reception Center\nUpon initial examination of the data, it becomes apparent that the majority of deaths occur at the Reception and Medical Center (RMC) in Lake Butler, Florida. This is because the RMC is the secure medical facility for the entire Florida Department of Corrections, and includes a hospital on site where individuals in need of hospitalization or specialty medical care are housed. The facility was founded in 1968 as an intake and processing point for all male state prisoners and as a secure medical facility.\n\n\nShow code\n\nper_month_all2 <- deaths %>%\n  group_by(FACILITY_description, month = floor_date(Date_Death, unit = \"month\")) %>%\n  summarise(Total_month_Deaths = n()) %>%\n  mutate(Facility_obs_count = sum(Total_month_Deaths))\n\nper_month_rmc_keyed <- per_month_all2 %>% mutate(RMC = FACILITY_description == 'R.M.C.- MAIN UNIT')\n\nggplot(per_month_rmc_keyed, aes(x = as.Date(month), y = Total_month_Deaths, fill = RMC)) + \n  geom_rect(aes(xmin = as.Date(\"2020-03-09\"), xmax = as.Date(\"2021-08-25\"), ymin = -Inf, ymax = Inf), fill = \"lightpink\", alpha = 0.3) +\n  geom_col() + \n  scale_x_date(date_labels = \"%B, %Y\", date_breaks = \"6 months\") +\n  theme(axis.text.x = element_text(angle = 90, hjust = 1)) +\n  coord_cartesian(xlim = as.Date(c(\"2015-07-02\", \"2023-06-29\"))) +\n  xlab(NULL) +\n  ylab('Count') +\n  labs(fill = \"\", title = \"Monthly FDOC Deaths -- RMC/Not-RMC:\") +\n  theme(legend.position = \"top\",\n        legend.direction = \"horizontal\",\n        legend.key.width = unit(1, \"cm\"),\n        legend.text = element_text(size = 10),\n        legend.key = element_rect(fill = c(\"blue\", \"lightpink\"), color = \"gray\")) +\n  scale_fill_manual(values = c(\"FALSE\" = \"blue\", \"TRUE\" = \"black\"),\n                    labels = c(\"Non Lake Butler RMC Death\", \"Lake Butler RMC Death\")) +\n  annotate(geom=\"text\", label='2020 COVID 19 Florida Emergency', x=as.Date('2020-12-09'), y=-1.75, size=2.5) +\n  labs(caption = \"Figure 4\")\n\n\n\nThe plot above displays the total number of deaths over time for the period covered by our data. It has been separated into Lake Butler and Non-Lake Butler deaths to better understand the contribution of deaths from Lake Butler and to highlight that the total number of deaths in the Florida Department of Corrections is largely determined by the frequency of deaths at Lake Butler RMC.\nIn my experience, Lake Butler, Florida is one of the most dangerous sites in the prison system in terms of assaults on the incarcerated population by staff. During my time incarcerated in Florida, I was personally housed at Lake Butler RMC on multiple occasions, due to the medical problems I experienced surrounding my food allergies while incarcerated, and I was there a total of about a year altogether. During that time, I personally witnessed many acts of violence and assault, most from staff members onto the incarcerated population, but equally as often did I see violence among the incarcerated population that was encouraged by a complicit staff.\nFor example, sometime around 2012, ten years into my sentence, I was sent back to Lake Butler RMC from my facility and was housed at the main unit in “I Block” for four months. This building was constructed shortly after the facility was opened. When I first entered the building with my property, I climbed a dark set of stairs. At the top of the flight, however, I found only a set of cell bars blocking the office area beyond the landing. In the office, behind a desk, a Sargent sat chatting with a shift officer. Moreover, on the landing at the top of the stairs, there was only concrete, but a set of footprints was painted onto the floor, facing the cinderblocks and only inches away.\nAlone and with no instructions, I stepped into the footprints and stood, nose to the wall and holding my property hanging by my arms at my side. After some time had passed, I heard a laugh and the sergeant say “you can throw him down the stairs if you need to.” That’s when I noticed that my feet had come off the footprints. In a panic, I fixed my feet and glanced behind me to see if I was still in danger. The sergeant had instructed one of his “run around” orderlies (an incarcerated person like myself) to fix my feet for me. Seeing that I’d done so myself, the orderly hesitated, obviously relieved, and the sergeant only laughed. Normally, just looking away from the wall would have been enough to merit violence, so I took his laugh as real evidence that I’d escaped harm by realizing on my own that my feet were misplaced.\nI myself ended up working as a runaround, and I worked for that sergeant for about four months. Though I managed to avoid committing violence on his behalf (much to his disappointment), I would not say that those four months were without trauma. Sergeant Moran has since been convicted of plotting to murder a former inmate, along with two other staff members, all of whom have been linked to the racist hate organization, the KKK.\nI have seen officers at Lake Butler RMC jumping up and down on incapacitated person’s faces. I have seen grown men slapped open-handed in the face by ‘correctional officers’ at Lake Butler RMC in front of hundreds of other men more times than I can count. I have seen officers at Lake Butler RMC smash a 17 year old child’s face through a pane of security glass (the kind with the wire in it) because of “his attitude”, and the next day they had a piece of paper with a smily face drawn on it taped over the broken glass.\nLake Butler Reception Medical Center is a bad place. For context, consider a similar institution: The Florida School for Boys, also known as the Arthur G. Dozier School for Boys. This reform school operated in the panhandle town of Marianna (equidistant from Talahassee as Lake Butler, but on the opposite side) from January 1, 1900, to June 30, 2011. Throughout its 111-year existence, the school gained a notorious reputation for abuse, assaults, and even student murders by staff members. Despite investigations, leadership changes, and promises of improvement, allegations of cruelty persisted. In 2009, a comprehensive investigation was ordered by the governor after a failed state inspection. Subsequent investigations in 2010 and 2011 substantiated claims of abuse and violence. Consequently, the school was permanently closed in June 2011. A survey by the University of South Florida revealed 55 burials on the school grounds, with most outside the designated cemetery area. The survey also documented nearly 100 deaths at the school.\nTo me and thousands of Florida citizens, Lake Butler Reception Medical Center represents a still-existent Dozier School, only for adults. The culture and norms that formed and supported the Dozier School are still present at Lake Butler, and it still today continues to act as a site of white racist repression, violence, and hate.\nI am greatly saddened that anyone would have to die there, in that nightmare of a place and wholly separated from those they love.\nHomicides\nHomicides By Facility\nThe chart below shows the number of homicides by facility. While it is possible that many of the homicides at Lake Butler RMC are individuals who were attacked at other facilities and then transferred to Lake Butler for medical treatment and subsequently counted as Lake Butler deaths (I’m sure any FDOC official would argue this to be the case), I personally don’t believe that this fully accounts for the entire homicide count at Lake Butler RMC.\n\n\nShow code\n\nviolent_FDOC <- deaths %>%\n  filter(Manner_Death ==\"Homicide\") %>%\n  mutate(month = floor_date(Date_Death, \"week\")) %>%\n  select(Date_Death, FACILITY_description)\n\nggplot(violent_FDOC, aes(x = reorder(FACILITY_description, FACILITY_description, function(x) length(x)))) +\n  geom_bar() +\n  geom_text(aes(label = ..count..), stat = \"count\", size =3.25, hjust = 1.5, color = \"white\") +\n  coord_flip() +\n  xlab(\"FDOC Facilities\") + \n  ylab(\"Homicide Count\") +\n  scale_y_discrete(labels = scales::label_number(scale = 1)) +\n  ggtitle(\"FDOC Homicides by Facility July 2015- June 2023\") +\n  labs(caption = \"Figure 5\")\n\n\n\nAccidental Deaths\n\n\nShow code\n\nper_week_all4 <- deaths %>%\n  filter(Manner_Death== 'Accident') %>%\n  group_by(week = floor_date(Date_Death, unit = \"week\")) %>%\n  summarise(Total_week_Deaths = n())\n\nt_value <- function(data, indices) {\n  scores <- scores(data[indices], type = \"t\")\n  abs(scores)\n}\n# Bootstrap:\nboot_tee <- boot(per_week_all4$Total_week_Deaths, t_value, R = 10000)\nper_week_all4$p_values <- 1 - pnorm(boot_tee$t0)\nper_week_all4$high <- per_week_all4$p_values<=0.05\n\nggplot(per_week_all4, aes(x = week, y= Total_week_Deaths, col= high)) +\n  geom_rect(aes(xmin = as.Date(\"2020-03-09\"), xmax = as.Date(\"2021-08-25\"), ymin = -Inf, ymax = Inf), fill = \"lightpink\", alpha = 0.7) +\n  geom_col() +\n  scale_x_date(date_labels = \"%B, %Y\", date_breaks = \"6 months\") +\n  theme(axis.text.x = element_text(angle = 90, hjust = 1)) +\n  coord_cartesian(xlim = as.Date(c(\"2015-07-02\", \"2023-06-29\"))) +\n  xlab(NULL) +\n  ylab('Count of Accidents') +\n  guides(color='none') +\n  annotate(geom=\"text\", label='2020 COVID 19 Florida Emergency', x=as.Date('2020-12-09'), y=-.25, size=2.5) +\n  labs(caption = \"Figure 6\")\n\n\n\nThe plot above shows the historical rate of occurrence of accidents resulting in deaths over the entire period covered by our data. To explain the coloration, the scores() algorithm utilizes the historical information available on frequency of accidental deaths to assess the probability of a given week being both ‘usual’ and having as many accidental deaths observed in that week as seen. The weeks that we see above displayed in blue are those weeks in which that calculated probability is less than 5%.\nThis spate of accidental deaths, it seems, did catch the notice of the Tampa Bay Times. According to the Times, the Florida prison system has long been considered one of the most dangerous in the US, with issues including inmate-on-inmate violence, use-of-force by staff, and problems with delivery of health care. At the time, they reported that the Florida Department of Corrections is investigating the causes of the spike, with an increase in overdoses on synthetic drugs like K2 being pointed to as a possible contributing factor. https://www.tampabay.com/news/politics/Record-number-of-inmates-died-in-Florida-prisons-last-year-And-they-died-younger-than-past-years-_164715214/\nSynthetic cannabinoids, also known as Spice or K2, are human-made chemicals designed to mimic the effects of THC, the primary psychoactive compound found in marijuana. They are often sprayed onto plant material and sold in small packages as a legal alternative to marijuana. The chemicals used to make synthetic cannabinoids are often changing, making them difficult to regulate and control. Synthetic cannabinoids entered the prison system around 2012, but it wasn’t until around 2016 that they became so prevalent that they were as easy to find as tobacco.\nThe chemicals used to make synthetic cannabinoids used around 2017, it seems, were particularly troublesome. That stuff was everywhere. People were walking around like zombies, having seizures everywhere.\nAccidental Deaths by Facility\n\n\nShow code\n\naccidents_FDOC <- deaths %>% filter(Manner_Death == 'Accident')\nggplot(accidents_FDOC %>% filter(Manner_Death == 'Accident'), aes(x = reorder(FACILITY_description, FACILITY_description, function(x) length(x)))) +\n  geom_bar() +   \n  geom_text(aes(label = ..count..), stat = \"count\", size =3.25, hjust = 1.5, color = \"white\") +\n  coord_flip() +\n  xlab(\"FDOC Facilities\") + \n  ylab(\"Fatal Accident Count\") +\n  ggtitle(\"Fatal FDOC Accidents by Facility July 2015- June 2023\") +\n  labs(caption = \"Figure 7\")\n\n\n\nI would say, yes, those are the facilites with the worst k2 problems. Someone should certainly double-check all those RMC ‘accidents’ though, particularly ones where incarcerated persons ‘fell down stairs’.\nNatural Deaths\n\n\nShow code\n\nper_week_natural <- deaths %>%\n  filter(Manner_Death == 'Natural') %>%\n  group_by(week = floor_date(Date_Death, unit = \"week\")) %>%\n  summarise(Total_week_Deaths = n())\n\nt_value <- function(data, indices) {\n  scores <- scores(data[indices], type = \"t\")\n  abs(scores)\n}\n# Bootstrap:\nboot_t <- boot(per_week_natural$Total_week_Deaths, t_value, R = 10000)\nper_week_natural$p_values <- pnorm(boot_t$t0, lower.tail = FALSE)\nper_week_natural$high <- per_week_natural$p_values<=0.05\n\nggplot(per_week_natural, aes(x = week, y= Total_week_Deaths, col= high)) +\n  geom_rect(aes(xmin = as.Date(\"2020-03-09\"), xmax = as.Date(\"2021-08-25\"), ymin = -Inf, ymax = Inf), fill = \"lightpink\", alpha = 0.7) +\n  geom_col() +\n  scale_x_date(date_labels = \"%B, %Y\", date_breaks = \"6 months\") +\n  theme(axis.text.x = element_text(angle = 90, hjust = 1)) +\n  coord_cartesian(xlim = as.Date(c(\"2015-07-02\", \"2023-06-29\"))) +\n  xlab(NULL) +\n  ylab('Count') +\n  guides(color='none') +\n  annotate(geom=\"text\", label='2020 COVID 19 Florida Emergency', x=as.Date('2020-12-09'), y=-1.75, size=2.5) +\n  ggtitle(label = 'FDOC Natural Deaths, June 2015 -July 2023') +\n  labs(caption = \"Figure 8\")\n\n\n\nHere we have a plot of the rate of natural deaths over the time period covered by our data. Once again, the weeks where the calculated probability of observing a result as extreme as the one seen is less than 5%.\nWhile it’s acknowledged that the pandemic has disrupted the normalcy of mortality rates, leading to a skewed baseline for expected deaths, this actually strengthens our case that the results here obtained using scores() are all the more salient and deserving of urgent attention, as the pandemic-induced distortions - resulting in a less sensitive scores() test - imply that any weeks yielding high scores are indicative of mortality rates that stand out as unusual even in the context of the pandemic.\nThe following weeks, filtered to exclude weeks during the 2020-2021 COVID emergency in Florida, stand out as exceptional in the FDOC with regards to the amount of natural deaths. While I refrain from positing any definitive explanations for why these particular facilities experienced heightened instances of natural deaths, I present this information as a potential avenue for future investigations by interested parties. The identification of any genuine causal relationships is of paramount interest, not only to the families who have lost loved ones during their incarceration but also to society at large, for a myriad of compelling reasons.\n\n\nShow code\n\ndepartmentwide <- per_week_natural %>%\n  filter((as.Date(week) <= as.Date(\"2020-03-09\") | as.Date(week) >= as.Date(\"2021-08-25\")) & high == TRUE & Total_week_Deaths > 2)\nkable(departmentwide %>% select(-high)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nweek\n\n\nTotal_week_Deaths\n\n\np_values\n\n\n2015-11-01\n\n\n12\n\n\n0.0444721\n\n\n2016-03-06\n\n\n12\n\n\n0.0444721\n\n\n2017-08-06\n\n\n12\n\n\n0.0444721\n\n\n2017-09-03\n\n\n12\n\n\n0.0444721\n\n\n2017-11-12\n\n\n12\n\n\n0.0444721\n\n\n2017-12-31\n\n\n13\n\n\n0.0220343\n\n\n2019-01-13\n\n\n14\n\n\n0.0099751\n\n\n2019-01-27\n\n\n13\n\n\n0.0220343\n\n\n2019-07-07\n\n\n12\n\n\n0.0444721\n\n\n2020-02-02\n\n\n13\n\n\n0.0220343\n\n\n2021-09-19\n\n\n14\n\n\n0.0099751\n\n\n2021-10-24\n\n\n12\n\n\n0.0444721\n\n\n2021-12-05\n\n\n12\n\n\n0.0444721\n\n\n2022-01-02\n\n\n12\n\n\n0.0444721\n\n\n2023-02-19\n\n\n13\n\n\n0.0220343\n\n\nGroupings Across Space, Natural Deaths\nIn the following analysis, we examine maps of groups of facilities that experienced months with statistically significant natural death counts. The plots that follow show all facilities that had at least one death during the respective month. The size and color of the markers correspond to the p-value, which represents the likelihood of observing such a high value for that facility based on its individual historical death data. Less likely results are plotted larger and redder than death counts that are more typical for that facility. You can see the labels for the facilities by hovering over the individual map markers.\nWhile it is valid to compare the p-values across maps by observing the size of the markers, it is not valid to compare colorations across maps at this time. This is because the colors of each map cover the spectrum of their respective associated data entries. Please note that this is a coding issue that I hope to fix soon.\n\n\nShow code\n\nper_month_natural2 <- deaths %>%\n  filter(Manner_Death == 'Natural') %>%\n  group_by(FACILITY_description, month = floor_date(Date_Death, unit = \"month\")) %>%\n  summarise(Total_month_naturalDeaths = n())\n\n\nt_value <- function(data, indices) {\n  scores <- scores(data[indices], type = \"t\")\n  abs(scores)\n}\n\nper_month_natural2 <- per_month_natural2 %>%\n  group_by(FACILITY_description) %>%\n  mutate(p_values = 1 - pnorm(boot(Total_month_naturalDeaths, t_value, R = 1000)$t0),\n            high = p_values <= 0.05)\n\nper_month_natural2$FACILITY_description <- as.factor(per_month_natural2$FACILITY_description)\nsummary_data1 <- per_month_natural2 %>%\n     group_by(month) %>%\n     #filter(high == TRUE) %>% \n     #filter(n() > 1) %>% \n     arrange(month) %>% \n     select(-high) %>%\n     mutate(group_index = row_number())\nsummary_data2 <-  summary_data1 %>%\n     summarize(\n         FACILITY_description = paste(FACILITY_description, collapse = \", \"),\n         Total_month_naturalDeaths = sum(Total_month_naturalDeaths)\n     )\nsummary_data3 <- summary_data2 %>% select(-Total_month_naturalDeaths)\n\ngenerate_group_names <- function(group_indices) {\n  group_names <- character(length(group_indices))\n  current_group <- 1\n  for (i in seq_along(group_indices)) {\n    if (group_indices[i] == 1) {\n      current_group <- current_group + 1\n    }\n    group_names[i] <- paste(\"Group\", current_group-1)\n  }\n  return(group_names)\n}\nsummary_data1$group_names <- generate_group_names(summary_data1$group_index)\n\n\n\n\nShow code\n\ngroupz <- summary_data1\ngroupz2 <- merge(groupz, cords, by = 'FACILITY_description') %>% arrange(month)\ninteresting_groups <- groupz2 %>%\n  filter(!(month >= as.Date(\"2020-03-09\") & month <= as.Date(\"2021-08-25\")))\nweeks_of_interest_mult <- unique(interesting_groups$month)\n\ninterest <- per_month_natural2 %>% \n  filter(month %in% weeks_of_interest_mult)\ninterest$p_values <- ifelse(is.na(interest$p_values) | is.nan(interest$p_values), 0.5, interest$p_values)\n\ninteresting <- merge(interest, cords[seq(1,138),], by = 'FACILITY_description') %>% arrange(month) #%>% filter(p_values<=0.25)\ninteresting$p_values[interesting$p_values == 0] <- 1e-6\ninteresting$high[is.na(interesting$high)] <- FALSE\n\n\n2015\nDecember 2015\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2015-12-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 12 & year(Date_Death) == 2015) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\npalette_name <- \"YlOrRd\"\nnum_colors <- 9\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>December 2015<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nAPALACHEE EAST UNIT\n\n\n2\n\n\n0.0086009\n\n\nTRUE\n\n\nCHARLOTTE C.I.\n\n\n2\n\n\n0.0437882\n\n\nTRUE\n\n\nUNION C.I.\n\n\n3\n\n\n0.1204806\n\n\nFALSE\n\n\nDADE C.I.\n\n\n1\n\n\n0.2409548\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n4\n\n\n0.2538635\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nLOWELL ANNEX\n\n\n1\n\n\n0.3465787\n\n\nFALSE\n\n\nSANTA ROSA C.I.\n\n\n1\n\n\n0.3518857\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nGULF C.I.- ANNEX\n\n\n1\n\n\n0.3551733\n\n\nFALSE\n\n\nNWFRC MAIN UNIT.\n\n\n1\n\n\n0.3838074\n\n\nFALSE\n\n\nCROSS CITY C.I.\n\n\n1\n\n\n0.4094192\n\n\nFALSE\n\n\nS.F.R.C SOUTH UNIT\n\n\n1\n\n\n0.4116593\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n11\n\n\n0.4646713\n\n\nFALSE\n\n\nCENTURY WORK CAMP\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nFRANKLIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJACKSON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nLOWELL C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMARTIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nWALTON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\n2016\nJanuary 2016\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2016-01-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 01 & year(Date_Death) == 2016) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>January 2016<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nSUMTER C.I.\n\n\n3\n\n\n0.0000010\n\n\nTRUE\n\n\nS.F.R.C.\n\n\n7\n\n\n0.0068091\n\n\nTRUE\n\n\nSOUTH BAY C.F.\n\n\n2\n\n\n0.1458386\n\n\nFALSE\n\n\nDADE C.I.\n\n\n1\n\n\n0.2409548\n\n\nFALSE\n\n\nCOLUMBIA CI\n\n\n1\n\n\n0.2635446\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n14\n\n\n0.2830091\n\n\nFALSE\n\n\nCFRC-MAIN\n\n\n1\n\n\n0.3286469\n\n\nFALSE\n\n\nSANTA ROSA C.I.\n\n\n1\n\n\n0.3518857\n\n\nFALSE\n\n\nGULF C.I.- ANNEX\n\n\n1\n\n\n0.3551733\n\n\nFALSE\n\n\nLAKE C.I.\n\n\n1\n\n\n0.3552111\n\n\nFALSE\n\n\nHOLMES WORK CAMP\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nFebruary 2016\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2016-02-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 02 & year(Date_Death) == 2016) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>February 2016<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nLAKE C.I.\n\n\n2\n\n\n0.0017074\n\n\nTRUE\n\n\nLOWELL ANNEX\n\n\n2\n\n\n0.0038738\n\n\nTRUE\n\n\nCHARLOTTE C.I.\n\n\n2\n\n\n0.0437882\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n6\n\n\n0.1150042\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n2\n\n\n0.3128311\n\n\nFALSE\n\n\nSANTA ROSA C.I.\n\n\n1\n\n\n0.3518857\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nNWFRC MAIN UNIT.\n\n\n1\n\n\n0.3838074\n\n\nFALSE\n\n\nCOLUMBIA ANNEX\n\n\n1\n\n\n0.4043794\n\n\nFALSE\n\n\nS.F.R.C SOUTH UNIT\n\n\n1\n\n\n0.4116593\n\n\nFALSE\n\n\nLOWELL WORK CAMP\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nWAKULLA ANNEX\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJune 2016\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2016-06-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 06 & year(Date_Death) == 2016) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>June 2016<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nGULF C.I.- ANNEX\n\n\n3\n\n\n0.0000039\n\n\nTRUE\n\n\nNWFRC MAIN UNIT.\n\n\n2\n\n\n0.0000133\n\n\nTRUE\n\n\nFLORIDA STATE PRISON\n\n\n1\n\n\n0.2909945\n\n\nFALSE\n\n\nCFRC-MAIN\n\n\n1\n\n\n0.3286469\n\n\nFALSE\n\n\nLIBERTY C.I.\n\n\n1\n\n\n0.3402821\n\n\nFALSE\n\n\nTAYLOR C.I.\n\n\n1\n\n\n0.3603565\n\n\nFALSE\n\n\nGRACEVILLE C.F.\n\n\n1\n\n\n0.3687634\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n10\n\n\n0.3785247\n\n\nFALSE\n\n\nHAMILTON ANNEX\n\n\n1\n\n\n0.3812502\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n3\n\n\n0.4654324\n\n\nFALSE\n\n\nFRANKLIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nFSP WEST UNIT\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nLOWELL C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nPALM BEACH\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJuly 2016\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2016-07-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 07 & year(Date_Death) == 2016) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>July 2016<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nS.F.R.C.\n\n\n8\n\n\n0.0008944\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n20\n\n\n0.0266139\n\n\nTRUE\n\n\nCHARLOTTE C.I.\n\n\n2\n\n\n0.0437882\n\n\nTRUE\n\n\nCOLUMBIA CI\n\n\n1\n\n\n0.2635446\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nMOORE HAVEN C.F.\n\n\n1\n\n\n0.3724195\n\n\nFALSE\n\n\nAVON PARK C.I.\n\n\n1\n\n\n0.3911629\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\n2018\nJanuary 2018\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2018-01-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 01 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>January 2018<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nHARDEE C.I.\n\n\n2\n\n\n0.0000010\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n21\n\n\n0.0150634\n\n\nTRUE\n\n\nEVERGLADES C.I.\n\n\n2\n\n\n0.0623552\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n1\n\n\n0.1427063\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n2\n\n\n0.2137894\n\n\nFALSE\n\n\nSUWANNEE C.I. ANNEX\n\n\n1\n\n\n0.2449102\n\n\nFALSE\n\n\nOKALOOSA C.I.\n\n\n1\n\n\n0.3047617\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nLIBERTY C.I.\n\n\n1\n\n\n0.3402821\n\n\nFALSE\n\n\nLOWELL ANNEX\n\n\n1\n\n\n0.3465787\n\n\nFALSE\n\n\nGRACEVILLE C.F.\n\n\n1\n\n\n0.3687634\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nFebruary 2018\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2018-02-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 02 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>February 2018<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nEVERGLADES C.I.\n\n\n3\n\n\n0.0000206\n\n\nTRUE\n\n\nFLORIDA STATE PRISON\n\n\n2\n\n\n0.0477904\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n15\n\n\n0.2129842\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n2\n\n\n0.2137894\n\n\nFALSE\n\n\nCOLUMBIA CI\n\n\n1\n\n\n0.2635446\n\n\nFALSE\n\n\nWAKULLA C.I.\n\n\n1\n\n\n0.2752781\n\n\nFALSE\n\n\nTOMOKA C.I.\n\n\n1\n\n\n0.2960718\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n2\n\n\n0.3128311\n\n\nFALSE\n\n\nSOUTH BAY C.F.\n\n\n1\n\n\n0.3313921\n\n\nFALSE\n\n\nBLACKWATER C.F.\n\n\n1\n\n\n0.3436268\n\n\nFALSE\n\n\nOKEECHOBEE C.I.\n\n\n1\n\n\n0.3597188\n\n\nFALSE\n\n\nDESOTO ANNEX\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJACKSON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nSUWANNEE C.I\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nTAYLOR ANNEX\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nTTH of BARSTOW\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMarch 2018\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2018-03-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 03 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>March 2018<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nMOORE HAVEN C.F.\n\n\n2\n\n\n0.0001038\n\n\nTRUE\n\n\nCHARLOTTE C.I.\n\n\n2\n\n\n0.0437882\n\n\nTRUE\n\n\nS.F.R.C.\n\n\n1\n\n\n0.1427063\n\n\nFALSE\n\n\nCOLUMBIA CI\n\n\n1\n\n\n0.2635446\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n14\n\n\n0.2830091\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nBLACKWATER C.F.\n\n\n1\n\n\n0.3436268\n\n\nFALSE\n\n\nMARION C.I.\n\n\n1\n\n\n0.3464199\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nFL.WOMENS RECPN.CTR\n\n\n1\n\n\n0.3911629\n\n\nFALSE\n\n\nS.F.R.C SOUTH UNIT\n\n\n1\n\n\n0.4116593\n\n\nFALSE\n\n\nJacksonville Bridge\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJEFFERSON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMayo Work Camp\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nWALTON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMay 2018\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2018-05-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 05 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>May 2018<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nSANTA ROSA C.I.\n\n\n2\n\n\n0.0022315\n\n\nTRUE\n\n\nCFRC-SOUTH\n\n\n3\n\n\n0.0061753\n\n\nTRUE\n\n\nDADE C.I.\n\n\n3\n\n\n0.1758421\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n4\n\n\n0.2538635\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nR.M.C.- WEST UNIT\n\n\n1\n\n\n0.3349077\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n10\n\n\n0.3785247\n\n\nFALSE\n\n\nNWFRC MAIN UNIT.\n\n\n1\n\n\n0.3838074\n\n\nFALSE\n\n\nMADISON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nOctober 2018\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2018-10-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 10 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>October 2018<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nMOORE HAVEN C.F.\n\n\n2\n\n\n0.0001038\n\n\nTRUE\n\n\nTOMOKA C.I.\n\n\n2\n\n\n0.0322889\n\n\nTRUE\n\n\nS.F.R.C.\n\n\n1\n\n\n0.1427063\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nBLACKWATER C.F.\n\n\n1\n\n\n0.3436268\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nGRACEVILLE C.F.\n\n\n1\n\n\n0.3687634\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n12\n\n\n0.4475405\n\n\nFALSE\n\n\nFSP WEST UNIT\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nLAKE CITY C.F.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nLOWELL C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nSUWANNEE C.I\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\n2019\nJanuary 2019\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2019-01-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 01 & year(Date_Death) == 2019) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>January 2019<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nMARION C.I.\n\n\n2\n\n\n0.0022543\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n23\n\n\n0.0040171\n\n\nTRUE\n\n\nS.F.R.C.\n\n\n7\n\n\n0.0068091\n\n\nTRUE\n\n\nCFRC-MAIN\n\n\n2\n\n\n0.0110296\n\n\nTRUE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nWAKULLA C.I.\n\n\n1\n\n\n0.2752781\n\n\nFALSE\n\n\nFLORIDA STATE PRISON\n\n\n1\n\n\n0.2909945\n\n\nFALSE\n\n\nSOUTH BAY C.F.\n\n\n1\n\n\n0.3313921\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nCALHOUN C.I.\n\n\n1\n\n\n0.3705908\n\n\nFALSE\n\n\nHAMILTON ANNEX\n\n\n1\n\n\n0.3812502\n\n\nFALSE\n\n\nNWFRC MAIN UNIT.\n\n\n1\n\n\n0.3838074\n\n\nFALSE\n\n\nHARDEE C.I.\n\n\n1\n\n\n0.3949665\n\n\nFALSE\n\n\nCOLUMBIA ANNEX\n\n\n1\n\n\n0.4043794\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nJuly 2019\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2019-07-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 01 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>July 2019<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nNWFRC MAIN UNIT.\n\n\n2\n\n\n0.0000133\n\n\nTRUE\n\n\nLIBERTY C.I.\n\n\n2\n\n\n0.0037632\n\n\nTRUE\n\n\nCFRC-SOUTH\n\n\n2\n\n\n0.1734046\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nLAKE C.I.\n\n\n1\n\n\n0.3552111\n\n\nFALSE\n\n\nUNION C.I.\n\n\n2\n\n\n0.3686474\n\n\nFALSE\n\n\nHOLMES C.I.\n\n\n1\n\n\n0.3821600\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nDADE C.I.\n\n\n2\n\n\n0.4553972\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n11\n\n\n0.4646713\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n3\n\n\n0.4654324\n\n\nFALSE\n\n\nJACKSON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\n2020\nFebruary 2020\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2020-02-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 02 & year(Date_Death) == 2020) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>February 2020<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nWAKULLA C.I.\n\n\n3\n\n\n0.0151859\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n19\n\n\n0.0444785\n\n\nTRUE\n\n\nBLACKWATER C.F.\n\n\n2\n\n\n0.3070776\n\n\nFALSE\n\n\nNWFRC ANNEX.\n\n\n1\n\n\n0.3126782\n\n\nFALSE\n\n\nSOUTH BAY C.F.\n\n\n1\n\n\n0.3313921\n\n\nFALSE\n\n\nLIBERTY C.I.\n\n\n1\n\n\n0.3402821\n\n\nFALSE\n\n\nLOWELL ANNEX\n\n\n1\n\n\n0.3465787\n\n\nFALSE\n\n\nLAKE C.I.\n\n\n1\n\n\n0.3552111\n\n\nFALSE\n\n\nOKEECHOBEE C.I.\n\n\n1\n\n\n0.3597188\n\n\nFALSE\n\n\nMOORE HAVEN C.F.\n\n\n1\n\n\n0.3724195\n\n\nFALSE\n\n\nHAMILTON ANNEX\n\n\n1\n\n\n0.3812502\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n3\n\n\n0.4654324\n\n\nFALSE\n\n\nSeptember 2021\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2021-09-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 09 & year(Date_Death) == 2021) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>September 2021<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nSOUTH BAY C.F.\n\n\n4\n\n\n0.0000000\n\n\nTRUE\n\n\nLAKE C.I.\n\n\n2\n\n\n0.0017074\n\n\nTRUE\n\n\nZEPHYRHILLS C.I.\n\n\n3\n\n\n0.0096387\n\n\nTRUE\n\n\nBLACKWATER C.F.\n\n\n3\n\n\n0.0716758\n\n\nFALSE\n\n\nSUWANNEE C.I. ANNEX\n\n\n1\n\n\n0.2449102\n\n\nFALSE\n\n\nWAKULLA C.I.\n\n\n1\n\n\n0.2752781\n\n\nFALSE\n\n\nNWFRC ANNEX.\n\n\n1\n\n\n0.3126782\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nCFRC-MAIN\n\n\n1\n\n\n0.3286469\n\n\nFALSE\n\n\nSANTA ROSA C.I.\n\n\n1\n\n\n0.3518857\n\n\nFALSE\n\n\nGRACEVILLE C.F.\n\n\n1\n\n\n0.3687634\n\n\nFALSE\n\n\nMOORE HAVEN C.F.\n\n\n1\n\n\n0.3724195\n\n\nFALSE\n\n\nAVON PARK C.I.\n\n\n1\n\n\n0.3911629\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n12\n\n\n0.4475405\n\n\nFALSE\n\n\nDADE C.I.\n\n\n2\n\n\n0.4553972\n\n\nFALSE\n\n\nAPALACHEE WEST UNIT\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nBAY C.F.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nFRANKLIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMARTIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nOctober 2021\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2021-10-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 10 & year(Date_Death) == 2021) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>October 2021<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nLIBERTY C.I.\n\n\n2\n\n\n0.0037632\n\n\nTRUE\n\n\nZEPHYRHILLS C.I.\n\n\n3\n\n\n0.0096387\n\n\nTRUE\n\n\nNWFRC ANNEX.\n\n\n2\n\n\n0.0195322\n\n\nTRUE\n\n\nDADE C.I.\n\n\n4\n\n\n0.0371233\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n7\n\n\n0.1646177\n\n\nFALSE\n\n\nSUWANNEE C.I. ANNEX\n\n\n1\n\n\n0.2449102\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n4\n\n\n0.2538635\n\n\nFALSE\n\n\nWAKULLA C.I.\n\n\n1\n\n\n0.2752781\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nCENTURY C.I.\n\n\n1\n\n\n0.3308400\n\n\nFALSE\n\n\nLAKE C.I.\n\n\n1\n\n\n0.3552111\n\n\nFALSE\n\n\nHAMILTON ANNEX\n\n\n1\n\n\n0.3812502\n\n\nFALSE\n\n\nSUWANNEE C.I\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nDecember 2021\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2021-12-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 01 & year(Date_Death) == 2018) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>December 2021<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nCFRC-MAIN\n\n\n2\n\n\n0.0110296\n\n\nTRUE\n\n\nSUWANNEE C.I. ANNEX\n\n\n3\n\n\n0.0260165\n\n\nTRUE\n\n\nBLACKWATER C.F.\n\n\n3\n\n\n0.0716758\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n5\n\n\n0.1063973\n\n\nFALSE\n\n\nWAKULLA C.I.\n\n\n1\n\n\n0.2752781\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n9\n\n\n0.2978757\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nCFRC-SOUTH\n\n\n1\n\n\n0.3148651\n\n\nFALSE\n\n\nLOWELL ANNEX\n\n\n1\n\n\n0.3465787\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nNWFRC MAIN UNIT.\n\n\n1\n\n\n0.3838074\n\n\nFALSE\n\n\nCROSS CITY C.I.\n\n\n1\n\n\n0.4094192\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nDADE C.I.\n\n\n2\n\n\n0.4553972\n\n\nFALSE\n\n\nJACKSON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJEFFERSON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nSUWANNEE C.I\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\n2022\nJanuary 2022\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2022-01-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 01 & year(Date_Death) == 2022) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>January 2022<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nCOLUMBIA CI\n\n\n3\n\n\n0.0200604\n\n\nTRUE\n\n\nSUWANNEE C.I. ANNEX\n\n\n3\n\n\n0.0260165\n\n\nTRUE\n\n\nWAKULLA C.I.\n\n\n2\n\n\n0.2363384\n\n\nFALSE\n\n\nDADE C.I.\n\n\n1\n\n\n0.2409548\n\n\nFALSE\n\n\nGULF C.I.\n\n\n1\n\n\n0.2427494\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n9\n\n\n0.2978757\n\n\nFALSE\n\n\nNWFRC ANNEX.\n\n\n1\n\n\n0.3126782\n\n\nFALSE\n\n\nCFRC-MAIN\n\n\n1\n\n\n0.3286469\n\n\nFALSE\n\n\nAPALACHEE EAST UNIT\n\n\n1\n\n\n0.3308400\n\n\nFALSE\n\n\nSOUTH BAY C.F.\n\n\n1\n\n\n0.3313921\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nUNION C.I.\n\n\n2\n\n\n0.3686474\n\n\nFALSE\n\n\nSUMTER C.I.\n\n\n1\n\n\n0.3911629\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n3\n\n\n0.4654324\n\n\nFALSE\n\n\nFRANKLIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nApril 2022\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2022-04-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 04 & year(Date_Death) == 2022) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>April 2022<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nSANTA ROSA C.I.\n\n\n2\n\n\n0.0022315\n\n\nTRUE\n\n\nLOWELL ANNEX\n\n\n2\n\n\n0.0038738\n\n\nTRUE\n\n\nOKALOOSA C.I.\n\n\n2\n\n\n0.0288898\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n8\n\n\n0.2258745\n\n\nFALSE\n\n\nDADE C.I.\n\n\n1\n\n\n0.2409548\n\n\nFALSE\n\n\nCFRC-MAIN\n\n\n1\n\n\n0.3286469\n\n\nFALSE\n\n\nCENTURY C.I.\n\n\n1\n\n\n0.3308400\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nLAKE C.I.\n\n\n1\n\n\n0.3552111\n\n\nFALSE\n\n\nCOLUMBIA ANNEX\n\n\n1\n\n\n0.4043794\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n3\n\n\n0.4654324\n\n\nFALSE\n\n\nSUWANNEE C.I\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMay 2022\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2022-05-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 05 & year(Date_Death) == 2022) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>May 2022<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nR.M.C.- MAIN UNIT\n\n\n2\n\n\n0.0169170\n\n\nTRUE\n\n\nCOLUMBIA CI\n\n\n3\n\n\n0.0200604\n\n\nTRUE\n\n\nDADE C.I.\n\n\n1\n\n\n0.2409548\n\n\nFALSE\n\n\nSUWANNEE C.I. ANNEX\n\n\n1\n\n\n0.2449102\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n4\n\n\n0.2538635\n\n\nFALSE\n\n\nSOUTH BAY C.F.\n\n\n1\n\n\n0.3313921\n\n\nFALSE\n\n\nMOORE HAVEN C.F.\n\n\n1\n\n\n0.3724195\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nDESOTO ANNEX\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nMADISON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nPOLK C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nWALTON C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nJune 2022\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2022-06-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 06 & year(Date_Death) == 2022) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>June 2022<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nTOMOKA C.I.\n\n\n2\n\n\n0.0322889\n\n\nTRUE\n\n\nR.M.C.- MAIN UNIT\n\n\n4\n\n\n0.0488819\n\n\nTRUE\n\n\nS.F.R.C.\n\n\n1\n\n\n0.1427063\n\n\nFALSE\n\n\nDADE C.I.\n\n\n3\n\n\n0.1758421\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nCHARLOTTE C.I.\n\n\n1\n\n\n0.2849107\n\n\nFALSE\n\n\nSANTA ROSA C.I.\n\n\n1\n\n\n0.3518857\n\n\nFALSE\n\n\nEVERGLADES C.I.\n\n\n1\n\n\n0.3551010\n\n\nFALSE\n\n\nCALHOUN C.I.\n\n\n1\n\n\n0.3705908\n\n\nFALSE\n\n\nCROSS CITY C.I.\n\n\n1\n\n\n0.4094192\n\n\nFALSE\n\n\nLAWTEY C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nSeptember 2022\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2022-09-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 09 & year(Date_Death) == 2022) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>September 2022<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nAPALACHEE EAST UNIT\n\n\n2\n\n\n0.0086009\n\n\nTRUE\n\n\nSUWANNEE C.I. ANNEX\n\n\n3\n\n\n0.0260165\n\n\nTRUE\n\n\nWAKULLA C.I.\n\n\n1\n\n\n0.2752781\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n14\n\n\n0.2830091\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nAVON PARK C.I.\n\n\n1\n\n\n0.3911629\n\n\nFALSE\n\n\nSANTA ROSA ANNEX\n\n\n1\n\n\n0.4137419\n\n\nFALSE\n\n\nFRANKLIN C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nTTH OF TARPON SPRING\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\nDecember 2022\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2022-12-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 12 & year(Date_Death) == 2022) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\n\nleaflet(data) %>%\n  addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n  addCircleMarkers(\n    radius = ~sqrt(sqrt(1/p_values)),\n    color = ~pal(sqrt(sqrt(1/p_values))),\n    fillOpacity = .45,\n    stroke = TRUE,\n    label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n  addControl(\n    position = \"bottomleft\",\n    html = \"<b style='font-size: 28px;'>December 2022<\/b>\"\n  ) %>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nFL.WOMENS RECPN.CTR\n\n\n2\n\n\n0.0000010\n\n\nTRUE\n\n\nZEPHYRHILLS C.I.\n\n\n3\n\n\n0.0096387\n\n\nTRUE\n\n\nCFRC-MAIN\n\n\n2\n\n\n0.0110296\n\n\nTRUE\n\n\nCOLUMBIA CI\n\n\n1\n\n\n0.2635446\n\n\nFALSE\n\n\nSUWANNEE C.I. ANNEX\n\n\n2\n\n\n0.2808445\n\n\nFALSE\n\n\nTOMOKA C.I.\n\n\n1\n\n\n0.2960718\n\n\nFALSE\n\n\nSOUTH BAY C.F.\n\n\n1\n\n\n0.3313921\n\n\nFALSE\n\n\nUNION C.I.\n\n\n2\n\n\n0.3686474\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n10\n\n\n0.3785247\n\n\nFALSE\n\n\nSUMTER C.I.\n\n\n1\n\n\n0.3911629\n\n\nFALSE\n\n\nHARDEE C.I.\n\n\n1\n\n\n0.3949665\n\n\nFALSE\n\n\nDADE C.I.\n\n\n2\n\n\n0.4553972\n\n\nFALSE\n\n\nLOWELL C.I.\n\n\n1\n\n\n0.5000000\n\n\nFALSE\n\n\n2023\nFebruary 2023\n\n\nShow code\n\ndata <- interesting %>% filter(month == '2023-02-01')\n\nmanners <- deaths %>%\n  filter(month(Date_Death) == 02 & year(Date_Death) == 2023) %>%\n  group_by(FACILITY_description, Manner_Death) %>% \n  summarise(count = n()) %>% \n  pivot_wider(names_from = Manner_Death, values_from = count, values_fill = 0) %>%\n  select(FACILITY_description, everything())\n\n# Define a continuous color palette\npalette_name <- \"YlOrRd\"\nnum_colors <- 9  # Number of colors in the palette\ncolors <- brewer.pal(n = num_colors, name = palette_name)[(num_colors / 2 + 1):num_colors]\npal <- colorNumeric(palette = colors, domain = sqrt(sqrt(1/data$p_values)))\n\nleaflet(data) %>%\n    addTiles(urlTemplate = \"https://server.arcgisonline.com/ArcGIS/rest/services/Canvas/World_Light_Gray_Base/MapServer/tile/{z}/{y}/{x}\", \n             options = tileOptions(minZoom = 1, maxZoom = 19)) %>%\n    addCircleMarkers(\n        radius = ~sqrt(sqrt(1/p_values)),\n        color = ~pal(sqrt(sqrt(1/p_values))),\n        fillOpacity = .45,\n        stroke = TRUE,\n        label = ~paste(\"Facility:\\n\", FACILITY_description, \"# Deaths: \", Total_month_naturalDeaths, \"P_value:\", round(p_values, 3))\n    ) %>%\n    addControl(\n        position = \"bottomleft\",\n        html = \"<b style='font-size: 28px;'>February 2023<\/b>\"\n    )%>%\n    setView(lng = -84, lat = 28.3, zoom = 6.5)\n\n\n\nShow code\n\nkable(data %>% select(FACILITY_description,Total_month_naturalDeaths,p_values,high) %>% arrange(p_values)) %>% \n  kable_styling(latex_options = \"hold_position\")\n\n\nFACILITY_description\n\n\nTotal_month_naturalDeaths\n\n\np_values\n\n\nhigh\n\n\nMARION C.I.\n\n\n2\n\n\n0.0022543\n\n\nTRUE\n\n\nOKALOOSA C.I.\n\n\n2\n\n\n0.0288898\n\n\nTRUE\n\n\nDADE C.I.\n\n\n1\n\n\n0.2409548\n\n\nFALSE\n\n\nSUWANNEE C.I. ANNEX\n\n\n1\n\n\n0.2449102\n\n\nFALSE\n\n\nZEPHYRHILLS C.I.\n\n\n1\n\n\n0.2655688\n\n\nFALSE\n\n\nUNION C.I.\n\n\n1\n\n\n0.3137573\n\n\nFALSE\n\n\nCFRC-MAIN\n\n\n1\n\n\n0.3286469\n\n\nFALSE\n\n\nAPALACHEE EAST UNIT\n\n\n1\n\n\n0.3308400\n\n\nFALSE\n\n\nHAMILTON ANNEX\n\n\n1\n\n\n0.3812502\n\n\nFALSE\n\n\nCROSS CITY C.I.\n\n\n1\n\n\n0.4094192\n\n\nFALSE\n\n\nR.M.C.- MAIN UNIT\n\n\n12\n\n\n0.4475405\n\n\nFALSE\n\n\nS.F.R.C.\n\n\n3\n\n\n0.4654324\n\n\nFALSE\n\n\n\n\n\n",
    "preview": "work/2023-09-19-mortality/distill-preview.png",
    "last_modified": "2023-09-22T14:56:06-04:00",
    "input_file": {}
  }
]
