[
  {
    "path": "creative/2023-09-19-speech/",
    "title": "Graduation Day Speech",
    "description": "I had the honor of delivering the ceremonial speech on graduation day for the Florida Gateway College Second Chance Pell graduation in May 2018. Here is the speech I gave.",
    "author": [],
    "date": "2023-09-20",
    "categories": [],
    "contents": "\n\n\n\nJohn Wise Gives Ceremonial Graduation Day Speech, Colummbia Correctional Institution May 2018 USA Today Network\n\n\nFriends, family, fellow graduates, esteemed staff, and guests, thank you for joining us here today in celebration of this achievement.\nI want those who have supported this program, or are in a position to support any program like it, to know that higher education programs in prison are worth it. Education saved my life. Education saved my life because it gave me power over my life.\nWe hear the phrase “Knowledge is power” so often that it has become cliché, but those of us who have known complete powerlessness and have been fortunate enough to gain access to education know the truth of that time-worn phrase. We cling to that truth as a drowning man to a lifeline.\nI have been incarcerated for almost seventeen years, so I happen to know many criminals. I know several of them very well. Never, in all of that time, have I ever met a man who was inherently “bad”. Instead of following the traditional flow of life, we have been swept up in sudden riptides, pulled away from our best selves by violent currents and our own internal whitewater hazards.\nHowever, those of us here today have been thrown a lifeline. Our education will keep us from being swept away by life’s random currents. It will be a vessel for us, so that we may support ourselves. It will be a ballast to stabilize us by allowing us to understand society and our roles within it. It will be the wind that we now know how to harness to fill our sails. It will be the clear night sky full of stars that we now know how to read and can use to navigate towards our dreams.\nKnowledge is power.\nI want our families to know that we are all here today because of you. Just you. This has not been easy, and we have faced many frustrations and challenges. We persevered for you. Each of us made sacrifices to be here. We made them for you. With all of the hardship and pain we have caused in our lives, we did this so that we could bring you some pride, so that you could be proud of us. We did this for you.\nI took a census of those of us graduating today; the 47 of us have a total of 73 children. We have 39 sons and 34 daughters. We did this for them. We did this so that we could be the fathers they need and the fathers they deserve. We did this so that we could support them and so that we could understand them and so that we may help them reach their dreams. We did this so that we may serve as an example to them. When we struggled, we spoke of how excited we were to share it with our families. We drove ourselves to be better for you and for you alone. Being here today, with you, has been our goal from the beginning.\nWe have brought you a victory. Thank you for being here, for sharing this victory with us. This means more to us than any of us could ever know how to say.\nFinally, I want my classmates to know, and I am speaking here to myself as well, that we really have done something powerful, meaningful, and good. I want us to take a moment to honestly reflect on that achievement. Do not let yourselves, or anyone else, convince you that the positive experience of earning a college degree can be devalued or diminished by having acquired it in prison. It is true that college is a positive and prison is a negative, but if you add the positive and the negative together, you don’t end up with zero, with nothing. To the contrary, the two experiences combine to become something greater.\nThose of us here today have spent the last two and a half years fully immersed in our studies. In many ways, we were not incarcerated; we found escape to a place where we could truly better ourselves. We have had the opportunity to engage with academic material in a way that any serious scholar would envy.\nI would not trade my Columbia Correctional Institution for a Columbia University Education, nor for any other education in the world. I could not be prouder to be among you men, to be one of your peers.\nThank you.\n\n\n\n",
    "preview": "creative/2023-09-19-speech/distill-preview.png",
    "last_modified": "2023-09-20T10:44:16-04:00",
    "input_file": "speech.knit.md"
  }
]
