[
  {
    "path": "creative/2023-09-20-free2learn/",
    "title": "2023 Santa Fe College's Free to Learn Initiative and Symposium",
    "description": "In March of 2023 I was a guest on the Santa Fe College's <i>Free to Learn<\/i> podcast, wherein I talked about my expereinces with higher education in prison, as well as my adjustment after release. Later, in April, I participated in the associated Summer Symposium.",
    "author": [],
    "date": "2023-09-25",
    "categories": [],
    "contents": "\nTo begin, I invite you to listen to the entire series. I was one of many formerly incarcerated individuals who participated in these events, and my peers in this space are truly amazing. You can find the entire series and additional information on the events by clicking the logo below.\n\n\n\n\nEpisode 1:\nIn these episodes, I discuss my journey towards higher education while being in prison. I share my experiences of participating in the Florida Gateway College program at Columbia Correctional Institution and The Community Education Project at Tomoka Correctional Institution. I highlight the importance of higher education for incarcerated individuals and also address the challenges that formerly incarcerated individuals face when trying to find and enroll in college courses after their release.\n\nYour browser does not support the audio element.\nEpisode 2:\n\nYour browser does not support the audio element.\nAfter the Panel\nDuring the symposium, I had the privilege of participating in a panel discussion on higher education for individuals currently incarcerated. However, the presence of Mr. Patrick Mahooney, the Director of Programs at the Florida Department of Corrections, significantly diminished the experience and quality of the panel. He accurately represented the style, aims, and interests of the Florida prison system, which was unfortunate.\nBelow is my response to this intrusion in our academic space, which I directly sent to the symposium administrators, Mr. Mahooney, and several department heads within the FDOC.\nFor additional context, during the panel discussion, Mr. Mahooney was asked about the challenges in rehabilitating incarcerated individuals. His response included two harmful and distracting points. Firstly, he asserted that the majority of those incarcerated are illiterate. Secondly, he took the opportunity to explain the so-called “legitimate purposes of incarceration.” In the following message, I will address both of these points. However, I believe it is important to also bring to your attention my immediate response at the time, specifically regarding the literacy levels of incarcerated individuals.\nI conveyed the following to the attendees: The statistics on literacy levels in prisons do not reflect the actual literacy level of those incarcerated, but rather the value that incarcerated individuals place on the test. What incentive do they have to complete the assessment honestly? None. As a newly incarcerated person, there is no good reason for me to honestly take your assessment when I know the information will be used against me. (One quickly learns that the “can and will be used against you” principle applies much more broadly to everything while incarcerated than just one’s words.) Not many people have any idea what those assessment days are like - they occur amidst weeks-long physical and psychological exams, complete upheaval, and random abuse. While I was taking my literacy assessment, there was a man being beaten in the hallway. I scored at a 9th-grade literacy level for math.\nGood afternoon, everyone.\nThank you for the opportunity to share some of my story and insights at last week’s symposium. Today, I am writing to follow up and share my overall thoughts on the experience.\nRegarding the student’s question about mental health services for formerly incarcerated students during the symposium, I want to clarify that I did not seek out mental health support while I was enrolled at your school because I did not realize the extent of my trauma until recently. After spending two decades under tremendous mental pressure and constant physical danger, it became the norm for me. It has taken me months to recognize and begin to address the void left behind by that trauma. I believe it is important to offer mental health support services to students like myself, realizing that they may not know that they need it.\nMore than anything, I would like to bring your attention to the fact that the inclusion of Mr. Mahoney in our breakout session was wholly inappropriate. Carceral agencies, such as prisons and detention centers, are inherently political organizations that often operate to the detriment of vulnerable communities. These institutions are designed to protect the interests of those who benefit from a world full of inequality, rather than to promote justice or rehabilitation. They are often used to maintain social control and to silence dissent, particularly among marginalized groups such as people of color, the LGBTQ+ community, and those living in poverty.\nI was not surprised when Mr. Mahoney lamented the Florida Department of Corrections’ neglect by the state legislature in the budget for too long. He was there to act as a political tool, hitting his talking points and maintaining the illusion of legitimacy and efficacy. As expected, he seized the opportunity to talk about the legitimate purposes of a correctional agency. However, from an academic perspective, the five legitimate purposes of incarceration as punishment - retribution, deterrence, incapacitation, rehabilitation, and restoration - are not without their critiques. Retribution is based on vengeance rather than justice, and deterrence is ineffective and disproportionately targets marginalized communities. Incapacitation, to the degree in which it is exercised in modern society, is overly punitive and fails to address underlying issues.\nFDOC officials nevertheless hide behind this flimsy support for legitimacy unfailingly and at every public opportunity. All mentions of the non-existent last two - the total failure of the state to provide anything more than the opposite of rehabilitation and restoration - are only heard as a call to bring us “to the classroom” on the others. However, what was most offensive was that Mr. Mahoney misrepresented those “in the care” of the Florida Department of Corrections while making these points.\nPrison officials often misrepresent the educational levels of incarcerated individuals to maintain the illusion that the prison system is rehabilitating and educating them. By exaggerating the situation and claiming that “the majority of those incarcerated are illiterate” (which is absurd), they gain emotional and shock-based leverage to request more funding for training, hiring, and morale.\nThe visions and missions of corrections agencies, whose primary aim is to incarcerate people, and educational institutions like colleges and universities, whose primary aim is to educate and empower individuals, are necessarily contradictory.\nWhile it may seem like a good idea for educational institutions to “partner” with carceral agencies like the Florida Department of Corrections, it is important to remember that these partnerships are often pursued for self-serving ends. Carceral agencies are not interested in rehabilitation, education, or empowerment. Instead, they aim to maintain their power and control. They use partnerships with educational institutions to gain legitimacy and funding, while perpetuating an unjust system that disproportionately harms marginalized communities.\nThe only way to run an educational program within a carceral setting that is not harmful is through a pedagogy of freedom. This approach recognizes the humanity and dignity of all individuals, regardless of their past actions. Carceral agencies must be resisted when they place barriers to legitimate connections with academic opportunities for those incarcerated, as well as when they use those opportunities as a means to control and coerce. When they deny access to books, the proper action is to take that to the media. When they try to control enrollment, the proper action is to take them to court. They must be resisted on every rule that limits, every whimsical and harmful decree.\nThey do not deserve a seat at a table.\n\n\n\n",
    "preview": "creative/2023-09-20-free2learn/distill-preview.png",
    "last_modified": "2023-09-25T15:29:50-04:00",
    "input_file": {}
  },
  {
    "path": "creative/2023-09-21-weight/",
    "title": "The Difference in Weight",
    "description": "The following short story, written in mid to late 2019, was published in the collection \"More than our Blues,\" which is available for purchase on Amazon. The profits from the book support the work of my currently incarcerated peers.",
    "author": [],
    "date": "2023-09-25",
    "categories": [],
    "contents": "\n\n\n\n\nIt wasn’t such an unpleasant job, as far as prison job assignments go. Troy had been a confinement orderly for a bit more than a week now; it even seemed like it could be somewhat nice. He had to get up at 3:30 am to be there in time to pass out breakfast at 4:30 am, but he was still grateful it kept him out of the kitchen. Those guys had to get up at 3 am and they stayed until 11 am; Troy was out of there every day at 6 am. Not only that, but all he had to do was handle the breakfast cart and do a little sweeping and mopping – no sweat.\nSome of the officers would even let him hustle. Like the officer he was working with now, Officer Moody. Moody seemed alright. Now that Troy had worked there a few days, he knew which cops would actually strip search him coming in and out and which would just pretend; Moody didn’t even make him take off his blues. Troy could traffic all sorts of stuff past Moody; the officer didn’t care at all. Just today, he had brought in two bars of soap, three packs of batteries, and a few Reader’s Digest magazines. He was going to be leaving with at least five books of stamps – the profit from the soap and batteries.\nWith Moody, he could also hustle trays. Extra trays went for five stamps each, and Moody didn’t care if he sold the cart itself, along with the contents. In fact, yesterday, Troy had messed up and sold too many trays. Moody had to call Food Service and order more so they could finish the last of wing 3. Moody was sweet.\n“Air-tray this asshole,” Moody told him now.\n“Sir?” Troy was startled. Moody stood there, held the flap tray open, and watched him with an empty expression. Did Troy hear him right? Officer Moody looked directly into Troy’s eyes and said with serene clarity, “Air. Tray. Him.”\nTroy had heard about this sort of thing in the county jail. An air-tray was exactly what it sounded like – a tray of air, empty. It appeared legitimate for the hallway camera, so the guy behind the door couldn’t file a grievance claiming that he hadn’t been fed; he would have a hungry, miserable day.\nTroy was frozen. He didn’t want to do it. It wasn’t that he was worried the guy behind the door might catch up with him out on the compound. Troy didn’t want to do it because he knew it wasn’t right. It was fundamentally different than breaking any rule. Prison rules are oppressive; they are meant to be broken. However, Troy had been raised to do unto others as he would have them do unto him. He couldn’t imagine having to spend a hungry day in the box himself. Troy didn’t have to do it, either; he could just as easily reach for the next full tray as he could the empty one. What could Moody do, beat Troy up? Lie, and give him a false disciplinary report? He couldn’t imagine either; not from Moody. Troy liked Moody; Moody let him hustle.\nTroy glanced over at the cell window, but couldn’t see the face of the man behind the door. He could see his shadow on the cell wall, but not his face. Troy was hoping that knowing who it was would help him to explain that he couldn’t do it, but he couldn’t imagine why the identity of the man would matter. Troy was only casting his gaze about, searching for a way out of the trap he’d fallen into.\nMoody cleared his throat expectantly. Even as Troy was trying to think of a way to explain to Moody that he couldn’t do it, Troy’s hands moved on their own accord in defiance of the signals his brain was sending. Numerous scenarios ran through his mind, but they got all tangled up against each other; he couldn’t sort them into a plan.\nTroy believed that he was going to make a stand; he envisioned himself telling Officer Moody he was sorry, that he couldn’t do it. He envisioned himself picking up the full tray, in defiance of Officer Moody, and handing it through the flap. He saw, in his mind, the disappointed look Moody would have on his face, felt the weight of the knowledge that Troy’s relationship with Moody would forever change. Troy tested his willingness to bear the repercussions of defying Officer Moody. He imagined that knowledge of imminent ramifications, and he believed he could do what he knew to be right, despite the consequences.\nHe believed it until the guy behind the door took the empty tray from Troy’s traitorous hands.\nThe hungry man expected a full, heavy tray, but the reality was hollow. The difference in weight between the expectation and reality caused him to bang the tray against the top of the door’s flap.\n“Bonk,” said the empty tray. To Troy, it was an accusation, a condemnation.\nJust before moving on to the next cell, Troy’s eyes moved from the flap to the cell window. He only saw his own reflection in the glass. The fluorescent lights made him look flat and empty; the mottled and thick glass made him appear distorted – slightly grotesque.\n\n\n\n",
    "preview": "creative/2023-09-21-weight/distill-preview.png",
    "last_modified": "2023-09-25T11:52:31-04:00",
    "input_file": {}
  },
  {
    "path": "creative/2023-09-20-whirlpool/",
    "title": "Whirlpool",
    "description": "A work of Fiction, initially written sometime around late 2017",
    "author": [],
    "date": "2023-09-21",
    "categories": [],
    "contents": "\n\n\nTroy wanted to take it back off, put it back in the box, and change back into his prison uniform.\nReally, he wanted to go back – back to the dorm, back to his bunk – but that feeling didn’t form into a\nconscious thought. It just stayed in the background as fear, a fear of going home that had been building\nfor months.\nIt wasn’t that he didn’t like the outfit that his family had sent him for this “big day” – a simple\ncombination of khaki pants and dress shirt – it was that the clothes felt unnatural, unsafe. He had put\nthem on, with a feeling of surrealism, and walked out of the little room in the visitation park like a\ncondemned man on the way to the gallows.\nNow he was waiting. His family was outside; he could see their car in the parking lot, through\nthe fences and wire. They were also waiting. To Troy, it felt like the whole world hung suspended on the\nedge of an abyss while the lieutenant, who had left him here, completed the last bit of mysterious\nprocessing that must be done before Troy would be a “free man”.\nTroy just sat. He sat and stared at the floor. He focused on keeping his breathing even. Free,\nthought Troy. He shook his head in denial.\n“Gavin? You still here?” The voice came from behind him. It was Officer Randall, the Inside\nGrounds supervisor. They knew each other slightly; Troy had been assigned extra duty with Randall\nonce, a few years back.\n“Yes sir.” Troy was confused. Was Randall here to tell him goodbye, to wish him good luck? He\nhad obviously come to the visitation park looking for Troy specifically.\n“I’ve got a piss test here for you. I’m glad I caught you before you left,” Randall said\nconversationally as he reached into a manila envelope. He extracted a little clear plastic jar with an\norange lid and tossed it into the air. With a feeling of absolute terror, Troy watched the jar’s flight. It\nlanded in Randall’s palm with the sound of a thunderclap, the sound of the earth cracking open for the\nentire world to fall into.\nTroy had smoked some pot, for the first time in at least five years, just last night. He had\nthought it would help him sleep; it hadn’t, but he hadn’t known what else to do. He had been so\nnervous about going home he’d had less than three hours of sleep every night for weeks. He didn’t even\nthink they did piss tests anymore. With there being so much synthetic trash in the prison system, next to\nno one tested positive for marijuana.\n“But, I’m going home today…” Troy stammered.\n“Not if you don’t pass this test, you’re not!” Randall countered with a casual, amused air; it was\nobvious that Randall hadn’t considered the possibility that Troy was dirty. “You fail this test, I gotta give\nya the full clip: sixty days in the box and one-hundred eighty days loss gain-time. Could you imagine?\nThat would suck! I don’t even know why ya’ll that’re going homes names’ appear on these lists, but this\nhas happened a few times. Some computer in Tallahassee makes the lists. ‘Puter don’t care that you\ngoin’ home. Ready?”\nTroy watched himself take the jar from Randall’s hand. He didn’t know what else to do, so he\njust watched. He watched himself cross the visitation park to the bathroom. He watched himself open\nthe door and step inside. Troy instinctively tried to shut the door behind him, to lock himself away from\nthe world until he could come to terms with what was going on, but of course, Randall was right behind\nhim.\n“Alright, pants and boxers all the way down around your ankles, you know the drill.” Randall\ninstructed matter-of-factly.\nTroy did as he was told. He stood in front of the toilet with a jar in one hand and his penis in the\nother. He stood there like that for several moments, staring at this strange tableau: toilet, jar, penis, and\nkhaki pants bunched up around his ankles. There were plaid boxers too. Plaid boxers? I’m supposed to\ngo home today, Troy recalled numbly.\n“I bet you’re ready to go, how long you been down?” Randall asked. His voice seemed to boom\noff the walls of the tiny bathroom. He was standing less than three feet from Troy.\n“Um, nineteen years,” Troy replied emptily. Really, he’d been locked up for eighteen years and\nnine months, but the difference didn’t seem to matter to Troy much. Not now.\n“Shit man, I can’t imagine how you must feel. Where you goin’?” Randall asked casually, as\nthough he was out having a beer with Troy and not standing next to him while he tried to urinate into a\nplastic jar.\n“Vermont. My folks drove down to pick me up…” Troy was starting to feel like he might pass\nout. Everything was spinning. A few drops of urine spread across the bottom of the jar, then a spurt. As\nTroy began to urinate fully, he watched the urine. The jar caused it to follow a circular path; it was a\ncounterclockwise yellow whirlpool of piss.\nApparently, the urine was swirling in the opposite direction as the room, because Troy felt\nsteadied in watching it.\n“Vermont! Hey, that’s enough piss. Go ahead and cap that jar and clean up.” Randall told him.\n“Man, you better not come back to this shit. Got a family up in Vermont…”\nTroy was beginning to get his bearings now. As Randall placed the jar on the visitation park table\nand prepared the testing kit, Troy began to think about how he could smooth talk Randall into helping\nhim get through this last barrier to freedom. Randall, after all, was a human being. Troy was sure he’d\nunderstand. He could talk to Randall.\nMaybe he wouldn’t even have to. Maybe it hadn’t been long enough for the drug to get to his\nurine. Maybe the test wouldn’t work.\n“How does that thing work?” Troy asked.\nJust then, the lieutenant came back into the room. Troy had forgotten about him. Troy felt his\nheart stop; a hole opened up where his stomach used to be, and he fell into that hole. He had no hope of talking his way out of this now…“Well,” Randall replied, oblivious to Troy’s internal death, “when the\npiss hits this paper here, it either gets a line across it if you are clean or no line if you are dirty. That line\nshould pop up here right away… Well, we’ll just give it a second…\n”The lieutenant came over and peered down onto the test as well. There was a long, silent\npause as the three men contemplated the tiny piece of plastic-enclosed urine-soaked paper. No line\nappeared.\n“You dirty son?” the lieutenant finally asked Troy.\n“I, um… yeah. I smoked a little pot last night so that I could sleep. I didn’t even really get high… I\njust needed to sleep…” Troy was sure they would understand. It was just a little pot, they would\nunderstand.\nAfter another long, full silence, the lieutenant sighed. He turned to Randall and said, “Cuff him\nup. Shit. He probably wouldn’t have made it three months out there anyhow.”\nTroy turned away and put his hands behind his back. He turned away in anger; he turned away\nin shame. He was now facing the parking lot. Through the window he saw his father and daughter\nstanding outside his father’s car. He saw them through the fences and the wire. He hadn’t known his\ndaughter was going to be there… Who was the young child with her?\nTroy wondered, Am I a grandfather? He hadn’t seen or heard from her in years… What would\nshe think of him now? What was their ride back across the country going to be like? Would he ever see\nher again? Her image blurred through his tears. Randall’s handcuffs felt familiar. The sound of their\ntightening comforted him, somehow fortified him. This realization disgusted Troy.\nTroy could hear the lieutenant on the telephone behind him, “Yeah, I know, world’s dumbest\ncriminal, right? The paperwork is going to be a nightmare; someone’s got to tell the family…huh? I\nhadn’t thought of that…”\nA long pause…\n“Okay, yeah, no problem… Yeah.” The lieutenant sounded disappointed. Click.\n“Randall, you gotta take those cuffs back offa him. I don’t know what I was thinking,” The\nlieutenant chuckled.\nAs the handcuffs were removed, Troy felt hope surge into his heart. Was this what it took Troy\nto finally realize that he did want to go home? If so, he was grateful. He now knew he was ready. He had\nimagined himself walking through the gates thousands of times; now he imagined himself, for the first\ntime, walking through the gates with a smile on his face. I’m going home! Troy triumphantly announced\nto himself. Troy rubbed the marks on his wrists that the handcuffs had left behind.\n“He’s gotta take that bullshit back off. I can’t take him to the box dressed like that.” The\nlieutenant said. “You hear that, dummy? Put your uniform back on!”\n\n\n\n",
    "preview": "creative/2023-09-20-whirlpool/distill-preview.png",
    "last_modified": "2023-09-21T08:12:38-04:00",
    "input_file": {}
  },
  {
    "path": "creative/2023-09-19-speech/",
    "title": "Graduation Day Speech",
    "description": "I had the honor of delivering the ceremonial speech on graduation day for the Florida Gateway College Second Chance Pell graduation in May 2018. Here is the speech I gave.",
    "author": [],
    "date": "2023-09-20",
    "categories": [],
    "contents": "\n\n\n\nJohn Wise Gives Ceremonial Graduation Day Speech, Colummbia Correctional Institution May 2018 USA Today Network\n\n\nFriends, family, fellow graduates, esteemed staff, and guests, thank you for joining us here today in celebration of this achievement.\nI want those who have supported this program, or are in a position to support any program like it, to know that higher education programs in prison are worth it. Education saved my life. Education saved my life because it gave me power over my life.\nWe hear the phrase “Knowledge is power” so often that it has become cliché, but those of us who have known complete powerlessness and have been fortunate enough to gain access to education know the truth of that time-worn phrase. We cling to that truth as a drowning man to a lifeline.\nI have been incarcerated for almost seventeen years, so I happen to know many criminals. I know several of them very well. Never, in all of that time, have I ever met a man who was inherently “bad”. Instead of following the traditional flow of life, we have been swept up in sudden riptides, pulled away from our best selves by violent currents and our own internal whitewater hazards.\nHowever, those of us here today have been thrown a lifeline. Our education will keep us from being swept away by life’s random currents. It will be a vessel for us, so that we may support ourselves. It will be a ballast to stabilize us by allowing us to understand society and our roles within it. It will be the wind that we now know how to harness to fill our sails. It will be the clear night sky full of stars that we now know how to read and can use to navigate towards our dreams.\nKnowledge is power.\nI want our families to know that we are all here today because of you. Just you. This has not been easy, and we have faced many frustrations and challenges. We persevered for you. Each of us made sacrifices to be here. We made them for you. With all of the hardship and pain we have caused in our lives, we did this so that we could bring you some pride, so that you could be proud of us. We did this for you.\nI took a census of those of us graduating today; the 47 of us have a total of 73 children. We have 39 sons and 34 daughters. We did this for them. We did this so that we could be the fathers they need and the fathers they deserve. We did this so that we could support them and so that we could understand them and so that we may help them reach their dreams. We did this so that we may serve as an example to them. When we struggled, we spoke of how excited we were to share it with our families. We drove ourselves to be better for you and for you alone. Being here today, with you, has been our goal from the beginning.\nWe have brought you a victory. Thank you for being here, for sharing this victory with us. This means more to us than any of us could ever know how to say.\nFinally, I want my classmates to know, and I am speaking here to myself as well, that we really have done something powerful, meaningful, and good. I want us to take a moment to honestly reflect on that achievement. Do not let yourselves, or anyone else, convince you that the positive experience of earning a college degree can be devalued or diminished by having acquired it in prison. It is true that college is a positive and prison is a negative, but if you add the positive and the negative together, you don’t end up with zero, with nothing. To the contrary, the two experiences combine to become something greater.\nThose of us here today have spent the last two and a half years fully immersed in our studies. In many ways, we were not incarcerated; we found escape to a place where we could truly better ourselves. We have had the opportunity to engage with academic material in a way that any serious scholar would envy.\nI would not trade my Columbia Correctional Institution for a Columbia University Education, nor for any other education in the world. I could not be prouder to be among you men, to be one of your peers.\nThank you.\n\n\n\n",
    "preview": "creative/2023-09-19-speech/distill-preview.png",
    "last_modified": "2023-09-20T10:44:16-04:00",
    "input_file": {}
  },
  {
    "path": "creative/2023-09-20-constitution/",
    "title": "Constitution",
    "description": "A Drama, initially written sometime around late 2017",
    "author": [],
    "date": "2023-09-20",
    "categories": [],
    "contents": "\n\n\n[In a noisy open-bay prison dormitory, one tall, middle-aged inmate (Kevin) excitedly\napproaches another inmate (James) who is reclining on the bottom rack of a double\nbunk. James, a slightly younger and shorter sort, places his book upon his chest and\nlistens]\nKevin: Hey, James?\nJames: What’s up Kevin?\nKevin: The Florida Channel is about to broadcast yesterday’s hearing on juvenile\nlife sentences, if you want to come and watch it.\nJames: Maybe, I’ve been kind of following that, what are they talking about now?\nKevin: This is the hearing that will determine whether or not the last decision will be\nretroactive.\nJames: And the last decision was… that it is unconstitutional to sentence a juvenile\nto a life sentence without any hope of release?\nKevin: So, that was the U.S. Supreme Court, and that was a few years ago… I\nguess that was 2010, so four years.\nJames: That was the Miller Case?\nKevin: No, that was Graham v. Florida. Miller v. Alabama was the case that\ndetermined it unconstitutional for juveniles to receive a life sentence without the\npossibility of parole for homicide cases.\nJames [confused]: Ok, so…\nKevin: You were, what, six months over eighteen when you caught your case? I’d\nthink you’d be paying closer attention here! I wish I had the luxury of being ignorant\nof what is going on… These last few years have been a real roller coaster for me.\nJames: But I didn’t get a life sentence! I got twenty-five years. I’m almost done\nnow… You’re right though. I should be paying closer attention.\nKevin: I don’t know why I keep forgetting you don’t have life. It’s like an automatic\nassumption with our charge… Murder equals life. You’re a lucky outlier.\nJames: I know…most of my best friends have life sentences for juvenile cases… I’m\ngoing to come and watch it; bring me up to speed real quick.\nKevin: Okay. So, first the U.S. Supreme court ruled that it was illegal to sentence a\njuvenile to life without the possibility of parole for non-homicide cases. Then, two\nyears later, they decided that applies to homicide cases as well. Now, the Florida\nSupreme Court is going to decide whether they consider that decision to apply\nretroactively.\nJames: What, could it not? They could decide that the decision of the U.S. Supreme\nCourt only applies to those who committed their crime after 2012? So, guys like you\n– guys that have been in prison for decades – would have to still wear life\nsentences?\nKevin: Yeah, but we’d be comforted by the knowledge that what happened to us\ncan’t happen to anyone else… that’s the argument anyway! Well, come on, it’s about\nto start.\nJames: Ok, just a second. Let me hit the can, and I’ll be right there.\n[Kevin leaves, and James sits up to put his shoes on. As Kevin walks away, James’s\nbunkmate, Steven, approaches. He hesitates before climbing onto the top rack and\nspeaks to James.]\nSteven: They just changed the channel. I was right in the middle of a movie, and\nthey changed the fucking channel! I’d be wrong if I floor-modeled that bitch.\nInconsiderate fuckers! They want to watch some law bullshit. They should have\nbeen worried about the law on the streets, and they wouldn’t be in prison!\nJames: Well, what they are watching actually is important. It’s the Florida Supreme\nCourt’s decision on whether juvenile life sentences are constitutional or not.\nSteven: Juvenile life sentences? Humph. What’s unconstitutional about that?\nJames: Well, the idea is that giving a juvenile a life sentence is the same as giving\nhim the death penalty, because he’s going to die in prison. The death penalty for\njuveniles was declared unconstitutional in 2005. Now they are working on the life\nsentences.\nSteven: Fuckers should be in prison for life, the death penalty is too easy for them!\nJames [stunned]: What?\nSteven: Anybody that kills someone deserves to suffer. They should have to do life\nin prison; the death penalty is letting them off too light. They should do life, and they\nshould send them all to the worst possible prisons – prisons where they get beaten\nand raped.\nJames: But… are you serious? People make mistakes! You made a mistake, you’re\nin prison!\nSteven: Not for killing nobody! I just sold some drugs, and it wasn’t no mistake. I\nknew what I was doing; I wanted some easy money. Those fuckers didn’t make no\nmistake neither; they knew what they were doing. That’s why it’s called\nmurder – it wasn’t no mistake. They are just sick. They’re sick, and deserve\nthe worst that can happen to them.\nJames [weakly]: I… the worst that can happen to them? But, the juveniles, they were\nso young. [gains confidence] They didn’t have the ability to understand the\nconsequences of their actions! Studies have shown that the brain isn’t fully\ndeveloped until-\nSteven [interrupts]: When? 35? That’s a bunch of bullshit. They got kids these days\ndrivin’ around and goin’ to college at 17. If they’s old enough to kill someone then\nthey can deal with the consequences! Aint no mopin’ around feelin’ sorry that some\nkiller is put away forever! That’s what’s best!\nJames: People can change though…\nSteven: Yeah, sure. Those juvenile killers can grow up and become grown-up\nkillers. Once a killer, always a killer. They got diseased minds. Once they get that\ntaste for blood – it’s like a dog – they turn evil; there aint no good in them anymore.\nYou wouldn’t want none of them out there around your family, that’s for sure.\nJames [clearly shaken, hesitates]: You really believe that? I mean, you’re not just\ntalking because you’re mad they changed the channel, but you think that’s true?\nReally?\nSteven[hops up on his rack and considers it for a few moments]: Yeah man.\nJames: That’s a hell of a thing to say though, “Once a killer, always a killer.” That’s\nsaying that a person that commits murder is not only not like a normal human being\nanymore, but that they are so un-human that they are not safe for others to be\naround, ever. Do you really think that’s true?\nSteven: I know it is. I known lots of murders since I been locked up, they’re all\nfucked up. There’s probably even a few of them in here… I don’t trust none of them. That’s why I keep to myself. You never know who you’re talking to around here.\nSome people are real fucked up.\n[James nods his head and walks away. The spotlight follows him to the bathroom,\nwhere he quietly sits\ndown on a toilet stool. He places his elbows on his knees, his head in his hands, and\nbegins to weep]\n\n\n\n",
    "preview": "creative/2023-09-20-constitution/distill-preview.png",
    "last_modified": "2023-09-20T15:55:13-04:00",
    "input_file": {}
  }
]
